<?php
// ------------------------------------------------------------------------- //
// Coppermine Photo Gallery 1.2.1                                            //
// ------------------------------------------------------------------------- //
// Copyright (C) 2002,2003 Gregory DEMAR                                     //
//  http://www.chezgreg.net/coppermine/                                      //
// ------------------------------------------------------------------------- //
// Updated by the Coppermine Dev Team                                        //
// (http://coppermine.sf.net/team/)                                          //
// see /docs/credits.html for details                                        //
// ------------------------------------------------------------------------- //
//  This program is free software; you can redistribute it and/or modify     //
//  it under the terms of the GNU General Public License as published by     //
//  the Free Software Foundation; either version 2 of the License, or        //
//  (at your option) any later version.                                      //
// ------------------------------------------------------------------------- //

// info about translators and translated language
$lang_translation_info = array(
'lang_name_english' => 'Serbian',  
'lang_name_native' => 'Српски', 
'lang_country_code' => 'sr', 
'trans_name'=> 'Mihailo Stefanovic', //the name of the translator - can be a nickname
'trans_email' => 'prevodi@mikis.org', //translator's email address (optional)
'trans_website' => 'http://mikis.org/', //translator's website (optional)
'trans_date' => '2004-01-03', //the date the translation was created / last modified
);

$lang_charset = 'windows-1251';
$lang_text_dir = 'ltr'; // ('ltr' for left to right, 'rtl' for right to left)

// shortcuts for Byte, Kilo, Mega
$lang_byte_units = array('бајтова', 'KB', 'MB');

// Day of weeks and months
$lang_day_of_week = array('Нед', 'Пон', 'Уто', 'Сре', 'Чет', 'Пет', 'Суб');
$lang_month = array('Јан', 'Феб', 'Мар', 'Апр', 'Мај', 'Јун', 'Јул', 'Авг', 'Сеп', 'Окт', 'Нов', 'Дец');

// Some common strings
$lang_yes = 'Да';
$lang_no  = 'Не';
$lang_back = 'НАЗАД';
$lang_continue = 'ДАЉЕ';
$lang_info = 'Информације';
$lang_error = 'Грешка';

// The various date formats
// See http://www.php.net/manual/en/function.strftime.php to define the variable below
$album_date_fmt =    '%d.%m.%Y';
$lastcom_date_fmt =  '%d.%m.%y @ %H:%M';
$lastup_date_fmt = '%d.%m.%Y';
$register_date_fmt = '%d.%m.%Y';
$lasthit_date_fmt = '%d. %B %Y у %H:%M';
$comment_date_fmt = '%d. %B %Y у %H:%M';

// For the word censor
$lang_bad_words = array('*fuck*', 'asshole', 'assramer', 'bitch*', 'c0ck', 'clits', 'Cock', 'cum', 'cunt*', 'dago', 'daygo', 'dego', 'dick*', 'dildo', 'fanculo', 'feces', 'foreskin', 'Fu\(*', 'fuk*', 'honkey', 'hore', 'injun', 'kike', 'lesbo', 'masturbat*', 'motherfucker', 'nazis', 'nigger*', 'nutsack', 'penis', 'phuck', 'poop', 'pussy', 'scrotum', 'shit', 'slut', 'titties', 'titty', 'twaty', 'wank*', 'whore', 'wop*');

$lang_meta_album_names = array(
        'random' => 'По случајном избору',
        'lastup' => 'Ново додато',
        'lastalb'=> 'Последњи ажуриран албум', 
        'lastcom' => 'Нови коментари',
        'topn' => 'Најгледаније',
        'toprated' => 'Најбоље оцењено',
        'lasthits' => 'Последње виђено',
        'search' => 'Резултати претраге', 
        'favpics'=> 'Омиљене слике' 
);

$lang_errors = array(
        'access_denied' => 'Није вам дозвољено да приступите овој страни.',
        'perm_denied' => 'Није вам дозвољено да извршите ову операцију.',
        'param_missing' => 'Скрипт је позван без обавезних параметара.',
        'non_exist_ap' => 'Изабрани албум или слика не постоје!',
        'quota_exceeded' => 'Диск квота је премашена<br /><br />Ваша диск квота је [quota]K, ваше слике требутно заузимају  [space]K. Додавањем ове слике премашили бисте квоту.',
        'gd_file_type_err' => 'Када користите GD библиотеку дозвољене су само JPEG и PNG врсте слика.',
        'invalid_image' => 'Слика коју сте послали је оштећена или је GD библиотека не подржава',
        'resize_failed' => 'Не могу да направим маркицу или смањим величину слике',
        'no_img_to_display' => 'Нема слика за приказивање',
        'non_exist_cat' => 'Изабрана категорија не постоји',
        'orphan_cat' => 'Категорија има непостојећег родитеља, покрените управљање категоријама да бисте исправили проблем.',
        'directory_ro' => 'У директоријум \'%s\' се не може уписивати, слике се не могу обрисати',
        'non_exist_comment' => 'Изабрани коментар не постоји.',
        'pic_in_invalid_album' => 'Слика је у непостојећем албуму (%s)!?', 
        'banned' => 'Забрањено вам је да посећујете овај сајт.', 
        'not_with_udb' => 'Ова функција је искључена у Coppermine-у јер је интегрисан са софтвером за форуме. Или то што покушавате да урадите није подржано у овој конфигурацији, или би за ту функцију требао да буде задужен софтвер за форуме.', 
);

// ------------------------------------------------------------------------- //
// File theme.php
// ------------------------------------------------------------------------- //

$lang_main_menu = array(
        'alb_list_title' => 'Иди на листу албума',
        'alb_list_lnk' => 'Листа албума',
        'my_gal_title' => 'Иди у моју личну галерију',
        'my_gal_lnk' => 'Моја галерија',
        'my_prof_lnk' => 'Мој профил',
        'adm_mode_title' => 'Пређи у административни режим',
        'adm_mode_lnk' => 'Административни режим',
        'usr_mode_title' => 'Пређи у кориснички режим',
        'usr_mode_lnk' => 'Кориснички режим',
        'upload_pic_title' => 'Пошаљи слику у албум',
        'upload_pic_lnk' => 'Пошаљи слику',
        'register_title' => 'Направи налог',
        'register_lnk' => 'Региструј се',
        'login_lnk' => 'Пријава',
        'logout_lnk' => 'Одјава',
        'lastup_lnk' => 'Ново додато',
        'lastcom_lnk' => 'Нови коментари',
        'topn_lnk' => 'Најгледаније',
        'toprated_lnk' => 'Најбоље оцењено',
        'search_lnk' => 'Претрага',
        'fav_lnk' => 'Моје омиљене', 
);

$lang_gallery_admin_menu = array(
        'upl_app_lnk' => 'Одобравање послатих',
        'config_lnk' => 'Подешавања',
        'albums_lnk' => 'Албуми',
        'categories_lnk' => 'Категорије',
        'users_lnk' => 'Корисници',
        'groups_lnk' => 'Групе',
        'comments_lnk' => 'Коментари',
        'searchnew_lnk' => 'Масовно додавање',
        'util_lnk' => 'Промена величине слика', 
        'ban_lnk' => 'Забрана корисника', 
);

$lang_user_admin_menu = array(
        'albmgr_lnk' => 'Направи / уреди моје албуме',
        'modifyalb_lnk' => 'Измени моје албуме',
        'my_prof_lnk' => 'Мој профил',
);

$lang_cat_list = array(
        'category' => 'Категорија',
        'albums' => 'Албуми',
        'pictures' => 'Слике',
);

$lang_album_list = array(
        'album_on_page' => '%d албума на %d страна'
);

$lang_thumb_view = array(
        'date' => 'ДАТУМ',
        //Sort by filename and title
        'name' => 'НАЗИВ ДАТ.', 
        'title' => 'НАСЛОВ', 
        'sort_da' => 'Сортирај по датуму узлазно',
        'sort_dd' => 'Сортирај по датуму силазно',
        'sort_na' => 'Сортирај по називу датотеке узлазно',
        'sort_nd' => 'Сортирај по називу датотекесилазно',
        'sort_ta' => 'Сортирај по наслову слике узлазно', 
        'sort_td' => 'Сортирај по наслову слике силазно', 
        'pic_on_page' => '%d слика на %d страна',
        'user_on_page' => '%d корисника на %d страна'
);

$lang_img_nav_bar = array(
        'thumb_title' => 'Врати се на страну са маркицама',
        'pic_info_title' => 'Прикажи/сакриј информације о слици',
        'slideshow_title' => 'Слајд шоу',
        'ecard_title' => 'Пошаљи ову слику као е-честитку',
        'ecard_disabled' => 'Е-честике су искључене',
        'ecard_disabled_msg' => 'Није вам дозвољено да шаљете е-честитке',
        'prev_title' => 'Види претходну слику',
        'next_title' => 'Види следећу слику',
        'pic_pos' => 'СЛИКА %s/%s',
);

$lang_rate_pic = array(
        'rate_this_pic' => 'Оцени ову слику ',
        'no_votes' => '(Нема гласова)',
        'rating' => '(тренутна оцена : %s / 5 са %s гласова)',
        'rubbish' => 'Ђубре',
        'poor' => 'Слаба',
        'fair' => 'Солидна',
        'good' => 'Добра',
        'excellent' => 'Одлична',
        'great' => 'Изванредна',
);

// ------------------------------------------------------------------------- //
// File include/exif.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/functions.inc.php
// ------------------------------------------------------------------------- //

$lang_cpg_die = array(
        INFORMATION => $lang_info,
        ERROR => $lang_error,
        CRITICAL_ERROR => 'Критична грешка',
        'file' => 'Датотека: ',
        'line' => 'Ред: ',
);

$lang_display_thumbnails = array(
        'filename' => 'Име датотеке: ',
        'filesize' => 'Величина датотеке: ',
        'dimensions' => 'Димензије: ',
        'date_added' => 'Датум додавања: '
);

$lang_get_pic_data = array(
        'n_comments' => '%s коментара',
        'n_views' => '%s прегледа',
        'n_votes' => '(%s гласова)'
);

// ------------------------------------------------------------------------- //
// File include/init.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/picmgmt.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/smilies.inc.php
// ------------------------------------------------------------------------- //

if (defined('SMILIES_PHP')) $lang_smilies_inc_php = array(
        'Exclamation' => 'Узвик',
        'Question' => 'Питање',
        'Very Happy' => 'Врло срећан',
        'Smile' => 'Осмех',
        'Sad' => 'Тужан',
        'Surprised' => 'Изненађен',
        'Shocked' => 'Шокиран',
        'Confused' => 'Збуњен',
        'Cool' => 'Cool',
        'Laughing' => 'Смеје се',
        'Mad' => 'Бесан',
        'Razz' => 'Плез',
        'Embarassed' => 'Потиђен',
        'Crying or Very sad' => 'Уплакан',
        'Evil or Very Mad' => 'Зао или врло бесан',
        'Twisted Evil' => 'Злоћа',
        'Rolling Eyes' => 'Преврће очима',
        'Wink' => 'Намиг',
        'Idea' => 'Идеја',
        'Arrow' => 'Стрелица',
        'Neutral' => 'Онако',
        'Mr. Green' => 'Зеленко',
);

// ------------------------------------------------------------------------- //
// File addpic.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File admin.php
// ------------------------------------------------------------------------- //

if (defined('ADMIN_PHP')) $lang_admin_php = array(
        0 => 'Напуштам административни режим...',
        1 => 'Прелазим у административни режим...',
);

// ------------------------------------------------------------------------- //
// File albmgr.php
// ------------------------------------------------------------------------- //

if (defined('ALBMGR_PHP')) $lang_albmgr_php = array(
        'alb_need_name' => 'Албуми морају имати име!',
        'confirm_modifs' => 'Да ли сте сигурни да желите да направите ове измене?',
        'no_change' => 'Нисте направили ни једну измену!',
        'new_album' => 'Нови албум',
        'confirm_delete1' => 'Да ли сте сигурни да желите да обришете овај албум?',
        'confirm_delete2' => '\nСве слике и коментари биће изгубљени!',
        'select_first' => 'Прво одаберите албум',
        'alb_mrg' => 'Управљање албумима',
        'my_gallery' => '* Моја галерија *',
        'no_category' => '* Нема категорије *',
        'delete' => 'Обриши',
        'new' => 'Нови',
        'apply_modifs' => 'Примени измене',
        'select_category' => 'Изабери категорију',
);

// ------------------------------------------------------------------------- //
// File catmgr.php
// ------------------------------------------------------------------------- //

if (defined('CATMGR_PHP')) $lang_catmgr_php = array(
        'miss_param' => 'Неопходни параметри за операцију \'%s\'нису задати!',
        'unknown_cat' => 'Изабрана категорија не постоји у бази',
        'usergal_cat_ro' => 'Категорија "корисничке галерије" се не може избрисати!',
        'manage_cat' => 'Уреди категорије',
        'confirm_delete' => 'Да ли сте сигурни да желите да ОБРИШЕТЕ ову категорију',
        'category' => 'Категорија',
        'operations' => 'Операције',
        'move_into' => 'Премести у ',
        'update_create' => 'Измени / направи категорију',
        'parent_cat' => 'Надређена категорија',
        'cat_title' => 'Назив категорије',
        'cat_desc' => 'Опис категорије'
);

// ------------------------------------------------------------------------- //
// File config.php
// ------------------------------------------------------------------------- //

if (defined('CONFIG_PHP')) $lang_config_php = array(
        'title' => 'Подешавања',
        'restore_cfg' => 'Врати подразумевана подешавања',
        'save_cfg' => 'Сачувај нова подешавања',
        'notes' => 'Напомене',
        'info' => 'Информације',
        'upd_success' => 'Coppermine подешавања су сачувана',
        'restore_success' => 'Враћена су подразумевана подешавања Coppermine-а',
        'name_a' => 'По имену узлазно',
        'name_d' => 'По имену силазно',
        'title_a' => 'По називу узлазно', 
        'title_d' => 'По називу силазно', 
        'date_a' => 'По датуму узлазно',
        'date_d' => 'По имену силазно',
        'th_any' => 'Макс. однос',
        'th_ht' => 'Висина',
        'th_wd' => 'Ширина',
      );

if (defined('CONFIG_PHP')) $lang_config_data = array(
        'Општа подешавања',
        array('Назив галерије', 'gallery_name', 0),
        array('Опис галерије', 'gallery_description', 0),
        array('Адреса е-поште администратора', 'gallery_admin_email', 0),
        array('Одредишна адреса линка \'Види још слика\' у е-дописницама', 'ecards_more_pic_target', 0),
        array('Језик', 'lang', 5),
        //array('омогући избор језика', 'lang_select_enable', 8 ),
        array('Тема', 'theme', 6),
        //array('омогући одабир теме', 'theme_select_enable', 8),

        'Преглед листе албума',
        array('Ширина главне табеле (тачака или %)', 'main_table_width', 0),
        array('Број нивоа приказаних категорија', 'subcat_level', 0),
        array('Број приказаних албума', 'albums_per_page', 0),
        array('Број колона у листи албума', 'album_list_cols', 0),
        array('Димензије маркице у тачкама', 'alb_list_thumb_size', 0),
        array('Садржај насловне стране', 'main_page_layout', 0),
        array('Прикажи маркице албума првог нивоа у категоријама','first_level',1), 

        'Преглед маркица',
        array('Број колона на страници са маркицама', 'thumbcols', 0),
        array('Број редова на страници са маркицама', 'thumbrows', 0),
        array('Максималан број приказаних поља', 'max_tabs', 0),
        array('Прикажи заглавље слике (поред наслова) испод маркице', 'caption_in_thumbview', 1),
        array('Прикажи број коментара испод маркице', 'display_comment_count', 1),
        array('Подразумевано сортирање слика', 'default_sort_order', 3),
        array('Минималан број гласова да би се слика појавила у листи \'најбоље оцењене\'', 'min_votes_for_rating', 0),

        'Преглед слика и подешавање коментара',
        array('Ширина табеле за приказивање слика (тачака или  %)', 'picture_table_width', 0),
        array('Информације о слици су подразумевано приказане', 'display_pic_info', 1),
        array('Избаци ружне речи из коментара', 'filter_bad_words', 1),
        array('Дозволи смајлије у коментарима', 'enable_smilies', 1),
        array('Максимална дужина описа слике', 'max_img_desc_length', 0),
        array('Максималан број слова у речи', 'max_com_wlength', 0),
        array('Максималан број линија у коментару', 'max_com_lines', 0),
        array('Максимална дужина коментара', 'max_com_size', 0),
        array('Прикажи филмску траку', 'display_film_strip', 1), 
        array('Број кадрова у филмској траци', 'max_film_strip_items', 0), 

        'Подешавања слика и маркица',
        array('Квалитет JPEG фајла', 'jpeg_qual', 0),
        array('Максималне димензије маркице <strong>*</strong>', 'thumb_width', 0), 
        array('Користи димензије (ширина или висина или макс. однос за маркицу) <strong>*</strong>', 'thumb_use', 7),    
        array('Прави међуслике','make_intermediate',1),
        array('Максимална ширина или висина међуслике <strong>*</strong>', 'picture_width', 0),
        array('Максимална величина послате слике (KB)', 'max_upl_size', 0),
        array('Максимална ширина или висина послате слике (тачака)', 'max_upl_width_height', 0),

        'Корисничка подешавања',
        array('Дозволи регистрацију нових корисника', 'allow_user_registration', 1),
        array('Регистрација нових корисника захтева проверу преко е-поште', 'reg_requires_valid_email', 1),
        array('Дозволи да два корисника имају исту адресу е-поште', 'allow_duplicate_emails_addr', 1),
        array('Корисници могу имати приватне албуме', 'allow_private_albums', 1),
array('Show Users avatar instead of private album picture', 'avatar_private_album', 1),
//'Custom fields for image description (leave blank if unused)',

        'Корисничка поља у описима слика (остави празно ако се не користе)',
        array('Назив поља 1', 'user_field1_name', 0),
        array('Назив поља 2', 'user_field2_name', 0),
        array('Назив поља 3', 'user_field3_name', 0),
        array('Назив поља 4', 'user_field4_name', 0),

        'Напредна подешавања слика и маркица',
        array('Прикажи иконицу приватног албума непријављеним корисницима','show_private',1), 
        array('Знакови који нису дозвољени у именима датотека', 'forbiden_fname_char',0),
        array('Дозвољене екстензије фајлова за послате слике', 'allowed_file_extensions',0),
        array('Начин промене величине слика','thumb_method',2),
        array('Путања до ImageMagick алата за конверзију (нпр. /usr/bin/X11/)', 'impath', 0),
        array('Дозвољене врсте слика (само за ImageMagick)', 'allowed_img_types',0),
        array('Опције командне линије за ImageMagick', 'im_options', 0),
        array('Читај EXIF податке из JPEG датотека', 'read_exif_data', 1),
        array('Директоријум албума <strong>*</strong>', 'fullpath', 0),
        array('Директоријум за корисничке слике <strong>*</strong>', 'userpics', 0),
        array('Префикс за међуслике <strong>*</strong>', 'normal_pfx', 0),
        array('Префикс за маркице <strong>*</strong>', 'thumb_pfx', 0),
        array('Подразумевани мод директоријума', 'default_dir_mode', 0),
        array('Подразумевани мод слика', 'default_file_mode', 0),

        'Подешавања колачића и скупова знакова',
        array('Назив колачића који ће скрипт корисити', 'cookie_name', 0),
        array('Путања до колачића који ће скрипт корисити', 'cookie_path', 0),
        array('Енкодинг', 'charset', 4),

        'Разна подешавања',
        array('Укључи мод за отклањање грешака', 'debug_mode', 1),

        '<br /><div align="center">(*) Поља означена са  * не смеју се мењати ако већ имате слика у галерији</div><br />'
);

// ------------------------------------------------------------------------- //
// File db_input.php
// ------------------------------------------------------------------------- //

if (defined('DB_INPUT_PHP')) $lang_db_input_php = array(
        'empty_name_or_com' => 'Морате унети своје име и коментар',
        'com_added' => 'Ваш коментар је додат',
        'alb_need_title' => 'Морате дати наслов албуму!',
        'no_udp_needed' => 'Ажурирање није потребно.',
        'alb_updated' => 'Албум је ажуриран',
        'unknown_album' => 'Одабрани албум не постоји или ви немате права да додајете слике у њега',
        'no_pic_uploaded' => 'Слика није послата!<br /><br />Ако сте заиста изабрали слику за слање, проверите да ли сервер дозвољава слање фајлова...',
        'err_mkdir' => 'Није успело креирање директоријума %s !',
        'dest_dir_ro' => 'Скрипт не може да пише у одредишни директоријум %s !',
        'err_move' => 'Није могуће преместити %s у %s !',
        'err_fsize_too_large' => 'Слика коју сте послали је превеликих димензија (максимално је дозвољено %s x %s) !',
        'err_imgsize_too_large' => 'Слика коју сте послали је превелика (максимално је дозвољено %s KB) !',
        'err_invalid_img' => 'Датотека који сте послали није исправна слика!',
        'allowed_img_types' => 'Можете послати само %s слика.',
        'err_insert_pic' => 'Слика \'%s\' се не може додати у албум ',
        'upload_success' => 'Ваша слика је успешно послата<br /><br />Биће приказана након одобрења администратора.',
        'info' => 'Информације',
        'com_added' => 'Коментар додат',
        'alb_updated' => 'Албум је ажуриран',
        'err_comment_empty' => 'Ваш коментар је празан!',
        'err_invalid_fext' => 'Дозвољене су датотеке само са следећим екстензијама: <br /><br />%s.',
        'no_flood' => 'Ви сте већ аутор последњег послатог коментара уз ову слику<br /><br />Можете изменити свој претходни коментар уколико то желите',
        'redirect_msg' => 'Бићете преусмерени.<br /><br /><br />Кликните \'НАСТАВИ\' ако се нова страна не учита аутоматски',
        'upl_success' => 'Слика је успешно додата',
);

// ------------------------------------------------------------------------- //
// File delete.php
// ------------------------------------------------------------------------- //

if (defined('DELETE_PHP')) $lang_delete_php = array(
        'caption' => 'Назив',
        'fs_pic' => 'слика пуне величине',
        'del_success' => 'успешно обрисано',
        'ns_pic' => 'слика нормалне величине',
        'err_del' => 'не може се обрисати',
        'thumb_pic' => 'маркица',
        'comment' => 'коментар',
        'im_in_alb' => 'слика у албуму',
        'alb_del_success' => 'Албум \'%s\' је обрисан',
        'alb_mgr' => 'Уређивање албума',
        'err_invalid_data' => 'Неисправни подаци примљени у \'%s\'',
        'create_alb' => 'Правим албум \'%s\'',
        'update_alb' => 'Ажурирам албум \'%s\' са називом \'%s\' и индексом \'%s\'',
        'del_pic' => 'Обриши слику',
        'del_alb' => 'Обриши албум',
        'del_user' => 'Обриши корисника',
        'err_unknown_user' => 'Изабрани корисник не постоји!',
        'comment_deleted' => 'Коментар је обрисан',
);

// ------------------------------------------------------------------------- //
// File displayecard.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File displayimage.php
// ------------------------------------------------------------------------- //

if (defined('DISPLAYIMAGE_PHP')){

$lang_display_image_php = array(
        'confirm_del' => 'Да ли сте сигурни да желите да ОБРИШЕТЕ ову слику? \\nКоментари ће такође бити избрисани.',
        'del_pic' => 'ОБРИШИ ОВУ СЛИКУ',
        'size' => '%s x %s тачака',
        'views' => '%s пута',
        'slideshow' => 'Слајд шоу',
        'stop_slideshow' => 'ЗАУСТАВИ СЛАЈД ШОУ',
        'view_fs' => 'Кликни за слику у пуној величини',
);

$lang_picinfo = array(
        'title' =>'Информације о слици',
        'Filename' => 'Назив датотеке',
        'Album name' => 'Назив албума',
        'Rating' => 'Оцена (%s гласова)',
        'Keywords' => 'Кључне речи',
        'File Size' => 'Величина фајла',
        'Dimensions' => 'Димензије',
        'Displayed' => 'Приказано',
        'Camera' => 'Камера',
        'Date taken' => 'Датум снимања',
        'Aperture' => 'Aperture',
        'Exposure time' => 'Време експозиције',
        'Focal length' => 'Жижна даљина',
        'Comment' => 'Коментар',
        'addFav'=>'Додај у омиљене', 
        'addFavPhrase'=>'Омиљене', 
        'remFav'=>'Уклони из омиљених', 
);

$lang_display_comments = array(
        'OK' => 'У РЕДУ',
        'edit_title' => 'Измени овај коментар',
        'confirm_delete' => 'Да ли сте сигурни да желите да обришете овај коментар?',
        'add_your_comment' => 'Додајте свој коментар',
        'name'=>'Име', 
        'comment'=>'Коментар', 
        'your_name' => 'Анон', 
);

$lang_fullsize_popup = array(
        'click_to_close' => 'Кликните на слику да затворите овај прозор', 
);

}

// ------------------------------------------------------------------------- //
// File ecard.php
// ------------------------------------------------------------------------- //

if (defined('ECARDS_PHP') || defined('DISPLAYECARD_PHP')) $lang_ecard_php =array(
        'title' => 'Пошаљи е-честитку',
        'invalid_email' => '<strong>Упозорење</strong> : неисправна адреса е-поште!',
        'ecard_title' => 'Е-честитка од %s за Вас',
        'view_ecard' => 'Ако се честитка не прикаже исправно, кликните на овај линк',
        'view_more_pics' => 'Кликните овде да видите још слика!',
        'send_success' => 'Ваша е-честитка је послата',
        'send_failed' => 'Жао нам је али сервер не може да пошаље вашу е-честитку...',
        'from' => 'Од',
        'your_name' => 'Ваше име',
        'your_email' => 'Ваша е-адреса',
        'to' => 'За',
        'rcpt_name' => 'Име примаоца',
        'rcpt_email' => 'Е-адреса примаоца',
        'greetings' => 'Поздрав',
        'message' => 'Порука',
);

// ------------------------------------------------------------------------- //
// File editpics.php
// ------------------------------------------------------------------------- //

if (defined('EDITPICS_PHP')) $lang_editpics_php = array(
        'pic_info' => 'Picture&nbsp;info',
        'album' => 'Албум',
        'title' => 'Назив',
        'desc' => 'Опис',
        'keywords' => 'Кључне речи',
        'pic_info_str' => '%s &times; %s - %s KB - %s приказа - %s гласова',
        'approve' => 'Одобри слику',
        'postpone_app' => 'Одложи одобравање',
        'del_pic' => 'Обриши слику',
        'reset_view_count' => 'Поништи бројач приказивања',
        'reset_votes' => 'Поништи гласање',
        'del_comm' => 'Обриши коментаре',
        'upl_approval' => 'Одобравање послатог',
        'edit_pics' => 'Уреди слике',
        'see_next' => 'Види следеће слике',
        'see_prev' => 'Види претходне слике',
        'n_pic' => '%s слика',
        'n_of_pic_to_disp' => 'Број приказаних слика',
        'apply' => 'Примени измене'
);

// ------------------------------------------------------------------------- //
// File groupmgr.php
// ------------------------------------------------------------------------- //

if (defined('GROUPMGR_PHP')) $lang_groupmgr_php = array(
        'group_name' => 'Назив групе',
        'disk_quota' => 'Диск квота',
        'can_rate' => 'Могу да оцењују слике',
        'can_send_ecards' => 'Могу да шаљу е-честитке',
        'can_post_com' => 'Могу да пишу коментаре',
        'can_upload' => 'Могу да шаљу слике',
        'can_have_gallery' => 'Могу да имају личне галерије',
        'apply' => 'Примени измене',
        'create_new_group' => 'Направи нову групу',
        'del_groups' => 'Обриши изабране групе',
        'confirm_del' => 'Упозорење, када обришете групу, корисници који јој припадају биће премештени у групу \'Registered\'!\n\nDo да желите да наставите?',
        'title' => 'Уређивање корисничких група',
        'approval_1' => 'Одобрење јавног слања (1)',
        'approval_2' => 'Одобрење приватног слања (2)',
        'note1' => '<strong>(1)</strong> За слање у јавни албум потребно је одобрење администратора',
        'note2' => '<strong>(2)</strong> За слање у корисников албум потребно је одобрење администратора',
        'notes' => 'Напомене'
);

// ------------------------------------------------------------------------- //
// File index.php
// ------------------------------------------------------------------------- //

if (defined('INDEX_PHP')){

$lang_index_php = array(
        'welcome' => 'Добродошли!'
);

$lang_album_admin_menu = array(
        'confirm_delete' => 'Да ли сте сигурни да желите да ОБРИШЕТЕ овај албум? \\nСве слике и коментари ће такође бити избрисани.',
        'delete' => 'ОБРИШИ',
        'modify' => 'СВОЈСТВА',
        'edit_pics' => 'УРЕДИ СЛИКЕ',
);

$lang_list_categories = array(
        'home' => 'Насловна',
        'stat1' => '<strong>[pictures]</strong> слика у <strong>[albums]</strong> албума и <strong>[cat]</strong> категорија са <strong>[comments]</strong> коментара приказаних <strong>[views]</strong> пута',
        'stat2' => '<strong>[pictures]</strong> слика у <strong>[albums]</strong> албума приказаних <strong>[views]</strong> пута',
        'xx_s_gallery' => 'Галерија %s',
        'stat3' => '<strong>[pictures]</strong> слика у <strong>[albums]</strong> албума са <strong>[comments]</strong> коментара приказаних <strong>[views]</strong> пута'
);

$lang_list_users = array(
        'user_list' => 'Листа корисника',
        'no_user_gal' => 'Нема корисничких галерија',
        'n_albums' => '%s албум(а)',
        'n_pics' => '%s слика(е)'
);

$lang_list_albums = array(
        'n_pictures' => '%s слика',
        'last_added' => ', последња додата %s'
);

}

// ------------------------------------------------------------------------- //
// File login.php
// ------------------------------------------------------------------------- //

if (defined('LOGIN_PHP')) $lang_login_php = array(
        'login' => 'Пријава',
        'enter_login_pswd' => 'Унесите корисничко име и лозинку',
        'username' => 'Корисничко име',
        'password' => 'Лозинка',
        'remember_me' => 'Запамти ме',
        'welcome' => 'Добродошли %s ...',
        'err_login' => '*** Пријављивање није успело. Покушајте поново ***',
        'err_already_logged_in' => 'Већ сте пријављени!',
);

// ------------------------------------------------------------------------- //
// File logout.php
// ------------------------------------------------------------------------- //

if (defined('LOGOUT_PHP')) $lang_logout_php = array(
        'logout' => 'Одјављивање',
        'bye' => 'Збогом %s ...',
        'err_not_loged_in' => 'Нисте пријављени!',
);

// ------------------------------------------------------------------------- //
// File modifyalb.php
// ------------------------------------------------------------------------- //

if (defined('MODIFYALB_PHP')) $lang_modifyalb_php = array(
        'upd_alb_n' => 'Ажурирај албуме %s',
        'general_settings' => 'Општа подешавања',
        'alb_title' => 'Назив албума',
        'alb_cat' => 'Категорија албума',
        'alb_desc' => 'Опис албума',
        'alb_thumb' => 'маркица албума',
        'alb_perm' => 'Дозволе за овај албум',
        'can_view' => 'Албум могу да виде',
        'can_upload' => 'Посетиоци могу да шаљу слике',
        'can_post_comments' => 'Посетиоци могу да дају коментаре',
        'can_rate' => 'Посетиоци могу да оцењују слике',
        'user_gal' => 'Корисничка галерија',
        'no_cat' => '* Нема категорије *',
        'alb_empty' => 'Албум је празан',
        'last_uploaded' => 'Последње послати',
        'public_alb' => 'Сви (јавни албум)',
        'me_only' => 'Само ја',
        'owner_only' => 'Само власник албума (%s)',
        'groupp_only' => 'Чланови групе \'%s\'',
        'err_no_alb_to_modify' => 'У бази нема албума који можете да мењате.',
        'update' => 'Ажурирај албум'
);

// ------------------------------------------------------------------------- //
// File ratepic.php
// ------------------------------------------------------------------------- //

if (defined('RATEPIC_PHP')) $lang_rate_pic_php = array(
        'already_rated' => 'Жао ми је, али већ сте оценили ову слику',
        'rate_ok' => 'Ваш глас је прихваћен',
);

// ------------------------------------------------------------------------- //
// File register.php & profile.php
// ------------------------------------------------------------------------- //

if (defined('REGISTER_PHP') || defined('PROFILE_PHP')) {

$lang_register_disclamer = <<<EOT
Мада ће администратори sajta {SITE_NAME} покушати да уклоне сваки објективно сумњив материјал у што краћем року, немогуће је прегледати сваки прилог. Због тога Ви прихватате да сваки прилог на овом сајту изражава погледе и мишљења његових аутора, а не администратора или вебмастера (осим прилога које они сами начине), те стога они неће бити за њих одговорни.<br />
<br />
Такође, Ви прихватате да нећете слати увредљив, опсен, вулгаран, клеветнички, претећи, сексуално орјентисан, или било какав други материјал који је у супротности са примењивим законима. Сагласни сте да вебмастери, администратори и модератори сајта {SITE_NAME} имају право да уклоне или измене било који садржај у било ком тренутку када то нађу за сходно. Као корисник, сагласни сте са тиме да се информације које сте претходно унели могу сачувати у бази података. Иако ове информације неће бити даване на увид било којој трећој страни без вашег одобрења, вебмастери и администратори нису одговорни за било који покушај хакерисања који може довести до угрожавања података.<br />
<br />
Овај сајт користи колачиће (cookies) да би сачувао податке на вашем рачунару. Ти колачићи су ту само ради вашег пријатнијег искуства са овим сајтом. Адреса е-поште коју сте дали биће коришћена само за проверу ваших детаља из регистрације и слање лозинке.<br />
<br />
Кликом на дугме 'Сагласан сам' испод Ви се слажете са овим наведеним условима.
EOT;

$lang_register_php = array(
        'page_title' => 'Регистрација корисника',
        'term_cond' => 'Услови и правила',
        'i_agree' => 'Сагласан сам',
        'submit' => 'Пошаљи регистрацију',
        'err_user_exists' => 'Корисничко име које сте изабрали већ постоји, молимо одаберите ново',
        'err_password_mismatch' => 'Лозинке се не подударају, молимо унесите их поново',
        'err_uname_short' => 'Корисничко име мора бити дужине бар 2 слова',
        'err_password_short' => 'Лозинка мора бити дужине бар 2 знака',
        'err_uname_pass_diff' => 'Корисничко име и лозинка морају се разликовати',
        'err_invalid_email' => 'Адреса е-поште је неисправна',
        'err_duplicate_email' => 'Неко се већ пријавио са адресом коју сте унели',
        'enter_info' => 'Унесите податке за регистрацију',
        'required_info' => 'Обавезни подаци',
        'optional_info' => 'Опциони подаци',
        'username' => 'Корисничко име',
        'password' => 'Лозинка',
        'password_again' => 'Понови лозинку',
        'email' => 'Е-адреса',
        'location' => 'Место',
        'interests' => 'Интересовања',
        'website' => 'Лични сајт',
        'occupation' => 'Занимање',
        'error' => 'ГРЕШКА',
        'confirm_email_subject' => '%s - Регистрација потврђена',
        'information' => 'Информације',
        'failed_sending_email' => 'Порука са потврдом регистрације није могла бити послата!',
        'thank_you' => 'Хвала што сте се регистровали.<br /><br />Порука са упутством како да активирате свој налог је послата на адресу е-поште коју сте дали.',
        'acct_created' => 'Ваш налог је направљен и можете се пријавити са својим корисничким именом и лозинком',
        'acct_active' => 'Ваш налог је сада активан и можете се пријавити са својим корисничким именом и лозинком',
        'acct_already_act' => 'Ваш налог је већ активан!!',
        'acct_act_failed' => 'Овај налог се не може активирати!',
        'err_unk_user' => 'Одабрани корисник не постоји!',
        'x_s_profile' => 'Профил корисника %s',
        'group' => 'Група',
        'reg_date' => 'Регистрован',
        'disk_usage' => 'Искоришћен простор',
        'change_pass' => 'Промени лозинку',
        'current_pass' => 'Тренутна лозинка',
        'new_pass' => 'Нова лозинка',
        'new_pass_again' => 'Понови лозинку',
        'err_curr_pass' => 'Тренутна лозинка је нетачна',
        'apply_modif' => 'Примени измене',
        'change_pass' => 'Промени моју лозинку',
        'update_success' => 'Ваш профил је измењен',
        'pass_chg_success' => 'Ваша лозинка је промењена',
        'pass_chg_error' => 'Ваша лозинка није промењена',
);

$lang_register_confirm_email = <<<EOT
Хвала Bам што сте се регистровали на {SITE_NAME}

Ваше корисничко име је: "{USER_NAME}"
Ваша лозинка је:        "{PASSWORD}"

Да бисте активирали свој налог, кликните на доњи линк или га прекопирајте
у свој интернет претраживач.

{ACT_LINK}

Срдачно ваши,

Управа сајта {SITE_NAME}

EOT;

}

// ------------------------------------------------------------------------- //
// File reviewcom.php
// ------------------------------------------------------------------------- //

if (defined('REVIEWCOM_PHP')) $lang_reviewcom_php = array(
        'title' => 'Прегледај коментаре',
        'no_comment' => 'Нема комента за приказивање',
        'n_comm_del' => '%s коментара обрисано',
        'n_comm_disp' => 'Број приказаних коментара',
        'see_prev' => 'Види претходне',
        'see_next' => 'Види следеће',
        'del_comm' => 'Обриши изабране коментаре',
);


// ------------------------------------------------------------------------- //
// File search.php - OK
// ------------------------------------------------------------------------- //

if (defined('SEARCH_PHP')) $lang_search_php = array(
        0 => 'Претражи колекцију слика',
);

// ------------------------------------------------------------------------- //
// File searchnew.php
// ------------------------------------------------------------------------- //

if (defined('SEARCHNEW_PHP')) $lang_search_new_php = array(
        'page_title' => 'Тражење нових слика',
        'select_dir' => 'Одабери директоријум',
        'select_dir_msg' => 'Ова функција омогућава додавање групе слика коју сте путем ФТП-а послали на свој сервер.<br /><br />Одаберите директоријум у који сте послали слике',
        'no_pic_to_add' => 'Нема слика за додавање',
        'need_one_album' => 'Морате имати бар један албум да бисте користили ову функцију',
        'warning' => 'упозорење',
        'change_perm' => 'скрипт не може да пише у овај директријум, морате му променити мод у 755 или 777 пре додавања нових слика!',
        'target_album' => '<strong>Додај слике из &quot;</strong>%s<strong>&quot; у </strong>%s',
        'folder' => 'Фолдер',
        'image' => 'Слика',
        'album' => 'Албум',
        'result' => 'Резултат',
        'dir_ro' => 'Није могућ упис. ',
        'dir_cant_read' => 'Није могуће читање. ',
        'insert' => 'Додавање нових слика у галерију',
        'list_new_pic' => 'Листа нових слика',
        'insert_selected' => 'Убаци одабране слике',
        'no_pic_found' => 'Нове слике нису пронађене',
        'be_patient' => 'Молимо будите стрпљиви, скрипту је потребно неко време да дода слике',
        'notes' =>  '<ul>'.
                                '<li><strong>OK</strong> : значи да је слика успешно додата'.
                                '<li><strong>DP</strong> : значи да је слика дупликат и да већ постоји у бази'.
                                '<li><strong>PB</strong> : значи да је слика није додата, проверите подешавања и права приступа директоријумима где се слике налазе'.
                                '<li>Ако се знаци OK, DP, PB не појаве, кликните на пукнуту слику да бисте видели поруку о грешци који вам је PHP пријавио'.
                                '<li>Ако време у вашем прегледачу истекне, притисните дугме \"освежи\"'.
                                '</ul>',
);


// ------------------------------------------------------------------------- //
// File thumbnails.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File banning.php
// ------------------------------------------------------------------------- //

if (defined('BANNING_PHP')) $lang_banning_php = array(
                'title' => 'Забрана корисника', 
                'user_name' => 'Корисничко име', 
                'ip_address' => 'ИП адреса', 
                'expiry' => 'Истиче (празно ако је заувек)', 
                'edit_ban' => 'Сними измене', 
                'delete_ban' => 'Обриши', 
                'add_new' => 'Додај нову забрану', 
                'add_ban' => 'Додај', 
);

// ------------------------------------------------------------------------- //
// File upload.php
// ------------------------------------------------------------------------- //

if (defined('UPLOAD_PHP')) $lang_upload_php = array(
        'title' => 'Пошаљи слику',
        'max_fsize' => 'Максимално дизвољена величина фајла је %s KB',
        'album' => 'Албум',
        'picture' => 'Слика',
        'pic_title' => 'Назив слике',
        'description' => 'Опис слике',
        'keywords' => 'Кључне речи (одвоји размаком)',
        'err_no_alb_uploadables' => 'Жао ми је, али нема албума у који вам је дозвољено да шаљете слике',
);

// ------------------------------------------------------------------------- //
// File usermgr.php
// ------------------------------------------------------------------------- //

if (defined('USERMGR_PHP')) $lang_usermgr_php = array(
        'title' => 'Уређивање корисника',
        'name_a' => 'имену узлазно',
        'name_d' => 'имену силазно',
        'group_a' => 'групи узлазно',
        'group_d' => 'групи силазно',
        'reg_a' => 'датуму рег. узлазно',
        'reg_d' => 'датуму рег. силазно',
        'pic_a' => 'броју слика узлазно',
        'pic_d' => 'броју слика силазно',
        'disku_a' => 'простору узлазно',
        'disku_d' => 'простору силазно',
        'sort_by' => 'Сортирај кориснике по',
        'err_no_users' => 'Табела корисника је празна!',
        'err_edit_self' => 'Не можете уређивати сопствени профил, користите линк \'Мој профил\' за то',
        'edit' => 'ИЗМЕНИ',
        'delete' => 'ОБРИШИ',
        'name' => 'Корисничко име',
        'group' => 'Група',
        'inactive' => 'Неактиван',
        'operations' => 'Операције',
        'pictures' => 'Слике',
        'disk_space' => 'Искоришћен простор / квота',
        'registered_on' => 'Регистрован',
        'u_user_on_p_pages' => '%d корисника на %d страна',
        'confirm_del' => 'Да ли сте сигурни да желите да ОБРИШЕТЕ овог корисника? \\nСве његове слике и албуми биће такође обрисани.',
        'mail' => 'ПОШТА',
        'err_unknown_user' => 'Изабрани корисник не постоји!',
        'modify_user' => 'Измени корисника',
        'notes' => 'Напомене',
        'note_list' => '<li>Ако не желите да промените тренутну лозинку, поље "лозинка" оставите празно',
        'password' => 'Лозинка',
        'user_active' => 'Корисник је активан',
        'user_group' => 'Корисничка група',
        'user_email' => 'Адреса е-поште',
        'user_web_site' => 'Адреса корисниковог сајта',
        'create_new_user' => 'Додај новог корисника',
        'user_location' => 'Локација корисника',
        'user_interests' => 'Интересовања корисника',
        'user_occupation' => 'Занимање корисника',
);

// ------------------------------------------------------------------------- //
// File util.php
// ------------------------------------------------------------------------- //

if (defined('UTIL_PHP')) $lang_util_php = array(
        'title' => 'Промена димензија слике', 
        'what_it_does' => 'Шта ради', 
        'what_update_titles' => 'Ажурира наслове по имену фајла', 
        'what_delete_title' => 'Брише наслове', 
        'what_rebuild' => 'Прави маркице и слике промењених димензија', 
        'what_delete_originals' => 'Брише оригиналне слике замењујући их верзијама промењене величине', 
        'file' => 'Датотека', 
        'title_set_to' => 'наслов постави на', 
        'submit_form' => 'изврши', 
        'updated_succesfully' => 'успешно измењена', 
        'error_create' => 'ГРЕШКА при креирању', 
        'continue' => 'Обради још слика', 
        'main_success' => 'Датотека %s је успешно искоришћена као главна слика', 
        'error_rename' => 'Грешка при преименовању %s у %s', 
        'error_not_found' => 'Датотека %s није пронађена', 
        'back' => 'назад на главну', 
        'thumbs_wait' => 'Ажурирам маркице и/или измењене слике, молим сачекајте...', 
        'thumbs_continue_wait' => 'Настављам да ажурирам маркице и/или слике измењене величине...', 
        'titles_wait' => 'Ажурирам наслове, молим сачекајте...', 
        'delete_wait' => 'Бришем наслове, молим сачекајте...', 
        'replace_wait' => 'Бришем оригинале и мењам их са измењеним сликама, молим сачекајте...', 
        'instruction' => 'Кратко упутство', 
        'instruction_action' => 'Одабери акцију', 
        'instruction_parameter' => 'Подеси параметре', 
        'instruction_album' => 'Одабери албум', 
        'instruction_press' => 'Притисни \'%s\'', 
        'update' => 'Ажурирај маркице и/или измењене слике', 
        'update_what' => 'Шта треба изменити', 
        'update_thumb' => 'Само маркице', 
        'update_pic' => 'Само слике измењене величине', 
        'update_both' => 'И маркице и слике измењене величине', 
        'update_number' => 'Број обрађених слика по клику', 
        'update_option' => '(Покушајте да поставите на мању вредност ако вам време истиче)', 
        'filename_title' => 'Назив датотеке &rArr; назив слике', 
        'filename_how' => 'Како треба изменити име датотеке', 
        'filename_remove' => 'Уклони .jpg завршетак и замени _ (доњу цртицу) размаком', 
        'filename_euro' => 'Промени 2003_11_23_13_20_20.jpg у 23/11/2003 13:20', 
        'filename_us' => 'Промени 2003_11_23_13_20_20.jpg у 11/23/2003 13:20', 
        'filename_time' => 'Промени 2003_11_23_13_20_20.jpg у 13:20', 
        'delete' => 'Обриши називе слика или оригиналне слике', 
        'delete_title' => 'Обриши називе слика', 
        'delete_original' => 'Обриши оригиналне слике', 
        'delete_replace' => 'Брише оригиналне слике и мења их сликама промењених димензија', 
        'select_album' => 'Одабери албум', 
);
// ------------------------------------------------------------------------- //
// File pagetitle.inc.php
// ------------------------------------------------------------------------- //
$lang_pagetitle_php = array(   
'divider' => '>',
    'viewing' => 'Viewing Photo',
    'usr' => "'s Photo Gallery",
    'photogallery' => 'Photo Gallery',
    );

?>