<?php
// ------------------------------------------------------------------------- //
//  Coppermine Photo Gallery v1.2.0                                          //
// ------------------------------------------------------------------------- //
//  Copyright (C) 2002  Grégory DEMAR <gdemar@wanadoo.fr>                    //
//  http://www.chezgreg.net/coppermine/                                      //
// ------------------------------------------------------------------------- //
//  Based on PHPhotoalbum by Henning Støverud <henning@stoverud.com>         //
//  http://www.stoverud.com/PHPhotoalbum/                                    //
// ------------------------------------------------------------------------- //
//  This program is free software; you can redistribute it and/or modify     //
//  it under the terms of the GNU General Public License as published by     //
//  the Free Software Foundation; either version 2 of the License, or        //
//  (at your option) any later version.                                      //
// ------------------------------------------------------------------------- //

// info about translators and translated language 
$lang_translation_info = array( 
'lang_name_english' => 'Ukrainian',  //the name of your language in English, e.g. 'Greek' or 'Spanish' 
'lang_name_native' => 'Óêðà¿íñüêà', //the name of your language in your mother tongue (for non-latin alphabets, use unicode) 
'lang_country_code' => 'ua', //the two-letter code for the country your language is most-often spoken (refer to http://www.iana.org/cctld/cctld-whois.htm), e.g. 'gr' or 'es' 
'trans_name'=> 'Kostya Jakovchuk', //the name of the translator - can be a nickname 
'trans_email' => 'kostya.jakovchuk@plast.org.ua', //translator's email address (optional) 
'trans_website' => 'http://lutsk.plast.org.ua', //translator's website (optional) 
'trans_date' => '2003-25-11', //the date the translation was created / last modified 
); 

$lang_charset = 'windows-1251';
$lang_text_dir = 'ltr'; // ('ltr' for left to right, 'rtl' for right to left)

// shortcuts for Byte, Kilo, Mega
$lang_byte_units = array('Áàéò', 'KB', 'MB');

// Day of weeks and months
$lang_day_of_week = array('Íåä³ëÿ', 'Ïîíåä³ëîê', 'Â³âòîðîê', 'Ñåðåäà', '×åòâåð', 'Ïÿòíèöÿ', 'Ñóáîòà');
$lang_month = array('Ñ³÷åíü', 'Ëþòèé', 'Áåðåçåíü', 'Êâ³òåíü', 'Òðàâåíü', '×åðâåíü', 'Ëèïåíü', 'Ñåðïåíü', 'Âåðåñåíü', 'Æîâòåíü', 'Ëèñòîïàä', 'Ãðóäåíü');

// Some common strings
$lang_yes = 'Òàê';
$lang_no  = 'Í³';
$lang_back = 'Íàçàä';
$lang_continue = 'Âïåðåä';
$lang_info = '²íôîðìàö³ÿ';
$lang_error = 'Ïîìèëêà';

// The various date formats
// See http://www.php.net/manual/en/function.strftime.php to define the variable below
$album_date_fmt =    '%d %B %Yð.';
$lastcom_date_fmt =  '%d %B %Yð. î %H:%M';
$lastup_date_fmt = '%d.%m.%Yð.';
$register_date_fmt = '%d %B %Yð.';
$lasthit_date_fmt = '%d %B %Yð. â %I:%M';
$comment_date_fmt =  '%d %B %Yð. â %H:%M';

// For the word censor
$lang_bad_words = array('*fuck*', 'asshole', 'assramer', 'bitch*', 'c0ck', 'clits', 'Cock', 'cum', 'cunt*', 'dago', 'daygo', 'dego', 'dick*', 'dildo', 'fanculo', 'feces', 'foreskin', 'Fu\(*', 'fuk*', 'honkey', 'hore', 'injun', 'kike', 'lesbo', 'masturbat*', 'motherfucker', 'nazis', 'nigger*', 'nutsack', 'penis', 'phuck', 'poop', 'pussy', 'scrotum', 'shit', 'slut', 'titties', 'titty', 'twaty', 'wank*', 'whore', 'wop*',
			'*ïèçä*', '*õóé*', '*çàåá*', '*ïèäàð*', '*æîïà*', '*óðîä*','*êîçë*','*áëÿ*','*õóå*');

$lang_meta_album_names = array( 
        'random' => 'Âèïàäêîâ³ ôîòî', 
        'lastup' => 'Îñòàíí³ äîëó÷åí³', 
        'lastalb'=> 'Îñòàííº ïîíîâëåííÿ àëüáîìó', 
        'lastcom' => 'Îñòàíí³ êîìåíòàð³', 
        'topn' => 'Ïîïóëÿðí³', 
        'toprated' => 'Êðàù³ çà ðåéòèíãîì', 
        'lasthits' => 'Îñòàíí³ ïåðåãëÿíóò³', 
        'search' => 'Ðåçóëüòàòè ïîøóêó', 
        'favpics'=> 'Âèáðàí³',
);

$lang_errors = array(
	'access_denied' => 'Âè ìàºòå íåäîñòàòíüî ïîâíîâàæåíü äëÿ ïåðåãëÿäó ö³º¿ ñòîð³íêè.',
	'perm_denied' => 'Âè ìàºòå íåäîñòàòíüî ïîâíîâàæåíü äëÿ âèêîíàííÿ ö³º¿ îïåðàö³¿.',
	'param_missing' => 'Ñêðèïò âèêëèêàíî áåç ïîòð³áíèõ ïàðàìåòð³â.',
	'non_exist_ap' => 'Îáðàíèé Âàìè àëüáîì/ôîòî íå ³ñíóº!',
	'quota_exceeded' => 'Ðîçì³ð äèñêîâîãî ïðîñòîðó ïåðåâèùåíî.<br /><br />Äëÿ Âàñ äèñêîâèé ïðîñò³ð ñòàíîâèòü [quota]Ká. Âàø³ ôîòî çàéìàþòü [space]Ká. Äîëó÷åííÿ öüîãî ôîòî ïåðåâèùèòü ïðèïóñòèìó ìåæó.',
	'gd_file_type_err' => 'ßêùî âèêîðèñò³âóºòüñÿ á³áë³îòåêà GD - äîçâîëåí³ ôîðìàòè çîáðàæåíü ò³ëüêè JPEG òà PNG.',
	'invalid_image' => 'Çàâàíòàæåíå ôîòî ç³ïñîâàíå, àáî íå ìîæå áóòè îïðàöüîâàíå á³áë³îòåêîþ GD',
	'resize_failed' => 'Íåìîæëèâî ñòâîðèòè ñëàéä àáî çìåíøèòè ðîçì³ð ôîòî.',
	'no_img_to_display' => 'Íåìà ôîòî',
	'non_exist_cat' => 'Âèáðàíà êàòåãîð³ÿ íå ³ñíóº',
	'orphan_cat' => 'Êàòåãîð³ÿ íå ìàº \'ãîëîâíîãî êàòàëîãó\'. Çàïóñò³òü Ìåíåäæåð êàòàëîã³â äëÿ âèïðàâëåííÿ ñèòóàö³¿.',
	'directory_ro' => 'Ïàïêà \'%s\' ò³ëüêè äëÿ ïåðåãëÿäó, ôîòî íåìîæëèâî âèäàëèòè',
	'non_exist_comment' => 'Âèáðàíèé êîìåíòàð íå ³ñíóº.',
	'pic_in_invalid_album' => 'Ôîòî ç íå³ñíóþ÷îãî àëüáîìó (%s)!?',
        'banned' => 'Âàì ñþäè íå äîçâîëåíî çàõîäèòè.', 
        'not_with_udb' => 'Öþ ôóíêö³þ âèìêíåíî â Coppermine, îñê³ëüêè âîíà º ïðèºäíàíà äî ôîðóìó. Àáî òå, ùî Âè íàìàãàºòåñÿ âèêîíàòè, íà ï³äòðèìóºòüñÿ êîíô³ãóðàö³ºþ.', 
);

// ------------------------------------------------------------------------- //
// File theme.php
// ------------------------------------------------------------------------- //

$lang_main_menu = array(
	'alb_list_title' => 'Äî ñïèñêà àëüáîìó',
	'alb_list_lnk' => 'Ñïèñîê êàòåãîð³é',
	'my_gal_title' => 'Äî ïåðñîíàëüíî¿ ãàëåðå¿',
	'my_gal_lnk' => 'Ìîÿ ãàëåðåÿ',
	'my_prof_lnk' => 'Ïðîô³ëü',
	'adm_mode_title' => 'Ïåðåéòè â ðåæèì àäì³í³ñòðàòîðà',
	'adm_mode_lnk' => 'Ðåæèì àäì³í³ñòðàòîðà',
	'usr_mode_title' => 'Ïåðåéòè â ðåæèì êîðèñòóâà÷à',
	'usr_mode_lnk' => 'Ðåæèì êîðèñòóâà÷à',
	'upload_pic_title' => 'Äîëó÷åííÿ ôîòî äî àëüáîìó',
	'upload_pic_lnk' => 'Äîëó÷èòè ôîòî',
	'register_title' => 'Çàðåºñòðóâàòèñÿ',
	'register_lnk' => 'Ðåºñòðàö³ÿ',
	'login_lnk' => 'Âõ³ä',
	'logout_lnk' => 'Âèõ³ä',
	'lastup_lnk' => 'Îñòàíí³ äîëó÷åí³',
	'lastcom_lnk' => 'Îñòàíí³ êîìåíòàð³',
	'topn_lnk' => 'Ïîïóëÿðí³',
	'toprated_lnk' => 'Êðàù³ çà ðåéòèíãîì',
	'search_lnk' => 'Ïîøóê',
        'fav_lnk' => 'Âèáðàí³', 
);

$lang_gallery_admin_menu = array(
	'upl_app_lnk' => 'Ïåðåâ³ðêà äîëó÷åíü',
	'config_lnk' => 'Íàëàøòóâàííÿ',
	'albums_lnk' => 'Àëüáîìè',
	'categories_lnk' => 'Êàòåãîð³¿',
	'users_lnk' => 'Êîðèñòóâà÷³',
	'groups_lnk' => 'Ãðóïè',
	'comments_lnk' => 'Êîìåíòàð³',
	'searchnew_lnk' => 'Àâòîäîëó÷åííÿ',
        'util_lnk' => 'Çì³íèòè ðîçì³ð', //new in cpg1.2.0
        'ban_lnk' => 'Áàí êîðèñòóâà÷à',//new in cpg1.2.0
);

$lang_user_admin_menu = array(
	'albmgr_lnk' => 'Ñòâîðèòè/âïîðÿäêóâàòè ìî¿ àëüáîìè',
	'modifyalb_lnk' => 'Êîðåãóâàòè ìî¿ àëüáîìè',
	'my_prof_lnk' => 'Ïðîô³ëü',
);

$lang_cat_list = array(
	'category' => 'Êàòåãîð³ÿ',
	'albums' => 'Àëüáîì³â',
	'pictures' => 'Ôîòî',
);

$lang_album_list = array(
	'album_on_page' => '%d àëüáîì³â íà %d ñòîð³íêàõ'
);

$lang_thumb_view = array(
	'date' => 'Äàòà',
        //Sort by filename and title
        'name' => '²ìÿ ôàéëà', //new in cpg1.2.0
        'title' => 'Íàçâà',//new in cpg1.2.0
	'sort_da' => 'Ñîðò. ïî äàò³ [çðîñòàííÿ]',
	'sort_dd' => 'Ñîðò. ïî äàò³ [ñïàäàííÿ]',
	'sort_na' => 'Ñîðò. ïî ³ìåí³ [çðîñòàííÿ]',
	'sort_nd' => 'Ñîðò. ïî ³ìåí³ [ñïàäàííÿ]',
        'sort_ta' => 'Ñîðò. ïî íàçâ³ [çðîñòàííÿ]', 
        'sort_td' => 'Ñîðò. ïî íàçâ³ [ñïàäàííÿ]',  //new in cpg1.2.0
	'pic_on_page' => '%d ôîòî íà %d ñòîð³íö³(àõ)',
	'user_on_page' => '%d êîðèñòóâà÷³â íà %d ñòîð³íö³(àõ)'
);

$lang_img_nav_bar = array(
	'thumb_title' => 'Ïîâåðíóòèñü íà ñòîð³íêó ³ç ñëàéäîì',
	'pic_info_title' => 'Ïîêàçàòè/çàõîâàòè ³íôîðìàö³þ ïðî ôîòî',
	'slideshow_title' => 'Ñëàéä-øîó',
	'ecard_title' => 'Íàä³ñëàòè öå ôîòî ÿê eCard',
	'ecard_disabled' => 'eCards âèìêíåí³',
	'ecard_disabled_msg' => 'Ó Âàñ íåìàº äîñòàòí³õ ïîâíîâàæåíü eCards',
	'prev_title' => 'Ïîïåðåäíº ôîòî',
	'next_title' => 'Íàñòóïíå ôîòî',
	'pic_pos' => 'Ôîòî %s ç %s',
);

$lang_rate_pic = array(
	'rate_this_pic' => 'Îö³íèòè öå ôîòî',
	'no_votes' => '(Íå ãîëîñóâàëè)',
	'rating' => '(ðåéòèíã: %s ç 5 ç %s ãîëîñàìè)',
	'rubbish' => 'Í³ÿê',
	'poor' => 'Äóæå ïîãàíî',
	'fair' => 'Ïîãàíî',
	'good' => 'Ìîæå áóòè',
	'excellent' => 'Äîáðå',
	'great' => 'Ñóïåð',
);

// ------------------------------------------------------------------------- //
// File include/exif.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/functions.inc.php
// ------------------------------------------------------------------------- //

$lang_cpg_die = array(
	INFORMATION => $lang_info,
	ERROR => $lang_error,
	CRITICAL_ERROR => 'Êðèòè÷íà ïîìèëêà',
	'file' => 'Ôàéë: ',
	'line' => 'Ðÿäîê: ',
);

$lang_display_thumbnails = array(
	'filename' => 'Ôàéë : ',
	'filesize' => 'Ðîçì³ð ôàéëó: ',
	'dimensions' => 'Ðîçì³ðè : ',
	'date_added' => 'Äàòà äîëó÷åííÿ : '
);

$lang_get_pic_data = array(
	'n_comments' => '%s êîìåíòàð³â',
	'n_views' => '%s ïåðåãëÿä³â',
	'n_votes' => '(%s ãîëîñ³â)'
);

// ------------------------------------------------------------------------- //
// File include/init.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/picmgmt.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/smilies.inc.php
// ------------------------------------------------------------------------- //

if (defined('SMILIES_PHP')) $lang_smilies_inc_php = array(
	'Exclamation' => 'Exclamation',
	'Question' => 'Question',
	'Very Happy' => 'Very Happy',
	'Smile' => 'Smile',
	'Sad' => 'Sad',
	'Surprised' => 'Surprised',
	'Shocked' => 'Shocked',
	'Confused' => 'Confused',
	'Cool' => 'Cool',
	'Laughing' => 'Laughing',
	'Mad' => 'Mad',
	'Razz' => 'Razz',
	'Embarassed' => 'Embarassed',
	'Crying or Very sad' => 'Crying or Very sad',
	'Evil or Very Mad' => 'Evil or Very Mad',
	'Twisted Evil' => 'Twisted Evil',
	'Rolling Eyes' => 'Rolling Eyes',
	'Wink' => 'Wink',
	'Idea' => 'Idea',
	'Arrow' => 'Arrow',
	'Neutral' => 'Neutral',
	'Mr. Green' => 'Mr. Green',
);

// ------------------------------------------------------------------------- //
// File addpic.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File admin.php
// ------------------------------------------------------------------------- //

if (defined('ADMIN_PHP')) $lang_admin_php = array(
	0 => 'Âèõ³ä  ...',
	1 => 'Âõ³ä â ðåæèì àäì³í³ñòðàòîðà ...',
);

// ------------------------------------------------------------------------- //
// File albmgr.php
// ------------------------------------------------------------------------- //

if (defined('ALBMGR_PHP')) $lang_albmgr_php = array(
	'alb_need_name' => 'Àëüáîì ìóñèòü ìàòè íàçâó!',
	'confirm_modifs' => 'Âè ä³éñíî áàæàºòå çðîáèòè ö³ çì³íè?',
	'no_change' => 'Âè í³÷îãî íå çì³íèëè!',
	'new_album' => 'Íîâèé àëüáîì',
	'confirm_delete1' => 'Âè ä³éñíî áàæàºòå âèäàëèòè öåé àëüáîì?',
	'confirm_delete2' => '\nÂñ³ ôîòî ³ êîìåíòàð³ çíèêíóòü!',
	'select_first' => 'Ñïî÷àòêó îáåð³òü àëüáîì',
	'alb_mrg' => 'Êåðóâàííÿ àëüáîìàìè',
	'my_gallery' => '* Ìîÿ ãàëåðåÿ *',
	'no_category' => '* Íåìàº êàòåãîð³¿ *',
	'delete' => 'Âèäàëèòè',
	'new' => 'Íîâèé',
	'apply_modifs' => 'Çàñòîñóâàòè çì³íè'
);

// ------------------------------------------------------------------------- //
// File catmgr.php
// ------------------------------------------------------------------------- //

if (defined('CATMGR_PHP')) $lang_catmgr_php = array(
	'miss_param' => 'Íå íàäàíî ïàðàìåòðè, ïîòð³áí³ äëÿ âèêîíàííÿ îïåðàö³¿ \'%s\'!',
	'unknown_cat' => 'Âèáðàíà êàòåãîð³ÿ íå ³ñíóº â áàç³',
	'usergal_cat_ro' => 'Êàòåãîð³þ ãàëåðåé êîðèñòóâà÷³â íå ìîæå áóòè âèäàëåíî!',
	'manage_cat' => 'Êåðóâàííÿ êàòåãîð³ÿìè',
	'confirm_delete' => 'Âè ä³éñíî áàæàºòå âèäàëèòè öþ êàòåãîð³þ?',
	'category' => 'Êàòåãîð³ÿ',
	'operations' => 'Ä³ÿ',
	'move_into' => 'Ïåðåì³ñòèòè äî',
	'update_create' => 'Ïîíîâèòè/Ñòâîðèòè êàòåãîð³þ',
	'parent_cat' => 'Êàòåãîð³ÿ âåðõíüîãî ð³âíÿ',
	'cat_title' => 'Íàçâà êàòåãîð³¿',
	'cat_desc' => 'Îïèñ êàòåãîð³¿'
);

// ------------------------------------------------------------------------- //
// File config.php
// ------------------------------------------------------------------------- //

if (defined('CONFIG_PHP')) $lang_config_php = array(
	'title' => 'Êîíô³ãóðàö³ÿ',
	'restore_cfg' => 'Â³äíîâèòè çíà÷åííÿ ïî çàìîâ÷óâàííþ',
	'save_cfg' => 'Çáåðåãòè íîâó êîíô³ãóðàö³þ',
	'notes' => 'Íîòàòêè',
	'info' => '²íôîðìàö³ÿ',
	'upd_success' => 'Êîíô³ãóðàö³þ ïîíîâëåíî',
	'restore_success' => 'Êîíô³ãóðàö³þ ïî çàìîâ÷óâàííþ â³äíîâëåíî',
	'name_a' => '³ìåí³ [çðîñòàííÿ]',
	'name_d' => '³ìåí³ [ñïàäàííÿ]',
        'title_a' => 'Íàçâà [çðîñòàííÿ]', 
        'title_d' => 'Íàçâà [ñïàäàííÿ]',
	'date_a' => 'äàòå [çðîñòàííÿ]',
	'date_d' => 'äàòå [ñïàäàííÿ]',
        'th_any' => 'Max Aspect',
        'th_ht' => 'Âèñîòà',
        'th_wd' => 'Øèðèíà',
);

if (defined('CONFIG_PHP')) $lang_config_data = array(
	'Çàãàëüí³ íàëàøòóâàííÿ',
	array('Íàçâà ãàëåðå¿', 'gallery_name', 0),
	array('Îïèñ ãàëåðå¿', 'gallery_description', 0),
	array('eMail àäì³í³ñòðàòîðà ãàëåðå¿', 'gallery_admin_email', 0),
	array('Àäðåñà äëÿ ïîñèëàííÿ \'Äèâ. äîäàòêîâ³ ôîòî\' â eCards', 'ecards_more_pic_target', 0),
	array('Ìîâà', 'lang', 5),
	array('Òåìà', 'theme', 6),

	'Ïåðåãëÿä ñïèñêó àëüáîì³â',
	array('Øèðèíà ãîëîâíî¿ òàáëèö³ (ï³êñåë³â àáî %)', 'main_table_width', 0),
	array('Ê³ëüê³ñòü ð³âí³â êàòåãîð³é äëÿ ïîêàçó', 'subcat_level', 0),
	array('Ê³ëüê³ñòü àëüáîì³â äëÿ ïîêàçó', 'albums_per_page', 0),
	array('Ê³ëüê³ñòü êîëîíîê äëÿ ñïèñêó àëüáîì³â', 'album_list_cols', 0),
	array('Ðîçì³ð ñëàéä³â â ï³êñåëÿõ', 'alb_list_thumb_size', 0),
	array('Âì³ñò ãîëîâíî¿ ñòîð³íêè', 'main_page_layout', 0),
        array('Ïîêàçàòè ñïî÷àòêó ïåðøèé ð³âåíü ñëàéä³â â êàòåãîð³ÿõ','first_level',1),  //new in cpg1.2.0

	'Ïåðåãëÿä ñëàéä³â',
	array('Ê³ëüê³ñòü êîëîíîê íà ñòîð³íö³ ç ñëàéäàìè', 'thumbcols', 0),
	array('Ê³ëüê³ñòü ðÿäê³â íà ñòîð³íö³ ç ñëàéäàìè', 'thumbrows', 0),
	array('Ìàêñ. ê³ëüê³ñòü çàêëàäîê', 'max_tabs', 0),
	array('Ïîêàçóâàòè íàïèñ ôîòî ï³ä ñëàéäîì', 'caption_in_thumbview', 1),
	array('Ïîêàçóâàòè ê³ëüê³ñòü êîìåíòàð³â ï³ä ñëàéäîì', 'display_comment_count', 1),
	array('Ïîðÿäîê ñîðòóâàííÿ äëÿ ôîòî ïî çàìîâ÷óâàííþ', 'default_sort_order', 3),
	array('Ì³í³ìàëüíà ê³ëüê³ñòü ãîëîñ³â äëÿ ôîòî äëÿ â³äîáðàæåííÿ â ñïèñêó \'êðàùèõ çà ðåéòèíãîì\'', 'min_votes_for_rating', 0),

	'Ïåðåãëÿä ôîòî &amp; Íàëàøòóâàííÿ êîìåíòàð³â',
	array('Äîâæèíà òàáëèö³ äëÿ ïîêàçó ôîòî (ï³êñåë³â àáî %)', 'picture_table_width', 0),
	array('Ïî çàìîâ÷óâàííþ â³äîáðàæàºòüñÿ ³íôîðìàö³ÿ ïðî ôîòî', 'display_pic_info', 1),
	array('Ô³ëüòðóâàòè ïîãàí³ ñëîâà â êîìåíòàðÿõ', 'filter_bad_words', 1),
	array('Äîçâîëèòè ñìàéëèêè', 'enable_smilies', 1),
	array('Ìàêñ. äîâæèíà äëÿ îïèñó ôîòî', 'max_img_desc_length', 0),
	array('Ìàêñ. ê³ëüê³ñòü ñèìâîë³â â ñëîâ³', 'max_com_wlength', 0),
	array('Ìàêñ. ê³ëüê³ñòüðÿäê³â ó êîìåíòàð³', 'max_com_lines', 0),
	array('Ìàêñ. äîâæèíà êîìåíòàðÿ', 'max_com_size', 0),
        array('Ïîêàçóâàòè ñòð³÷êó çîáðàæåíü', 'display_film_strip', 1), 
        array('Ê³ëüê³ñòü çîáðàæåíü â ñòð³÷ö³', 'max_film_strip_items', 0), 

	'Íàëàøòóâàííÿ ôîòî òà ñëàéä³â',
	array('ßê³ñòü äëÿ JPEG ôàéë³â', 'jpeg_qual', 0),
	array('Ìàêñ. äîâæèíà àáî âèñîòà ñëàéäó <strong>*</strong>', 'thumb_width', 0),
        array('Âèêîðèñòîâóâàòè ðîçì³ð ( äîâæèíà àáî âèñîòà, ÷è  ìàêñèìàëüíà ñòîðîíà ñëàéäó )<strong>*</strong>', 'thumb_use', 7),  //new in cpg1.2.0
	array('Ñòâîðþâàòè ïðîì³æíå ôîòî','make_intermediate',1),
	array('Ìàêñ. äîâæèíà àáî âèñîòà ïðîì³æíîãî ôîòî <strong>*</strong>', 'picture_width', 0),
	array('Ìàêñ. ðîçì³ð äëÿ äîäàíèõ ôîòî (Ká)', 'max_upl_size', 0),
	array('Ìàêñ. äîâæèíà àáî âèñîòà äëÿ äîäàíèõ ôîòî (ï³êñåë³â)', 'max_upl_width_height', 0),

	'Íàëàøòóâàííÿ êîðèñòóâà÷à',
	array('Äîçâîëèòè ðåºñòðàö³þ íîâèõ êîðèñòóâà÷³â', 'allow_user_registration', 1),
	array('Ðåºñòðàö³ÿ âèìàãàº ïåðåâ³ðêè  eMailó', 'reg_requires_valid_email', 1),
	array('Äîçâîëèòè äâîì êîðèñòóâà÷àì ìàòè îäíàêîâ³ eMail', 'allow_duplicate_emails_addr', 1),
	array('Êîðèñòóâà÷³ ìîæóòü ìàòè âëàñí³ àëüáîìè', 'allow_private_albums', 1),
array('Show Users avatar instead of private album picture', 'avatar_private_album', 1),
//'Custom fields for image description (leave blank if unused)',

	'Äîâ³ëüí³ ïîëÿ îïèñó ôîòî (çàëèøèòè áåç çì³í ó âèïàäêó íåâèêîðèñòàííÿ)',
	array('Ïîëå 1', 'user_field1_name', 0),
	array('Ïîëå 2', 'user_field2_name', 0),
	array('Ïîëå 3', 'user_field3_name', 0),
	array('Ïîëå 4', 'user_field4_name', 0),

	'Ðîçøèðåí³ íàëàøòóâàííÿ ôîòî òà ñëàéä³â',
        array('Ïîêàçàòè âëàñíèé àëüáîì íåçàðåºñòðîâàíîìó êîðèñòóâà÷åâ³','show_private',1),  //new in cpg1.2.0
	array('Ñèìâîëè, çàáîðîíåí³ â íàçâàõ ôàéë³â', 'forbiden_fname_char',0),
	array('Äîäàâàòè ôîòî ç òàêèìè ðîçøèðåííÿìè:', 'allowed_file_extensions',0),
	array('Ìåòîä çì³íè ðîçì³ð³â ôîòî','thumb_method',2),
	array('Øëÿõ äî óòèë³òè \'convert\' â³ä ImageMagick (ïðèêëàä: /usr/bin/X11/)', 'impath', 0),
	array('Äîçâîëåí³ òèïè ôîòî (ï³äõîäèòü ò³ëüêè äëÿ ImageMagick)', 'allowed_img_types',0),
	array('Íàëàøòóâàííÿ êîìàíäíîãî ðÿäêà äëÿ ImageMagick', 'im_options', 0),
	array('×èòàòè EXIF-äàí³ â ôàéëàõ JPEG', 'read_exif_data', 1),
	array('Ïàïêà äëÿ àëüáîìó <strong>*</strong>', 'fullpath', 0),
	array('Ïàïêà äëÿ ôîòî êîðèñòóâà÷³â <strong>*</strong>', 'userpics', 0),
	array('Ïðåô³êñ äëÿ ïðîì³æíèõ ôîòî <strong>*</strong>', 'normal_pfx', 0),
	array('Ïðåô³êñ äëÿ ñëàéä³â <strong>*</strong>', 'thumb_pfx', 0),
	array('Ðåæèì äëÿ ïàïîê ïî çàìîâ÷óâàííþ (äëÿ *nix ñèñòåì)', 'default_dir_mode', 0),
	array('Ðåæèì äëÿ ôîòî ïî çàìîâ÷óâàííþ (äëÿ *nix ñèñòåì)', 'default_file_mode', 0),

	'Cookies &amp; íàëàøòóâàííÿ êîäîâî¿ ñòîð³íêè',
	array('²ìÿ cookie, âèêîðèñòîâóâàíå ñêðèïòîì', 'cookie_name', 0),
	array('Øëÿõ äëÿ cookie, âèêîðèñòîâóâàíèé ñêðèïòîì', 'cookie_path', 0),
	array('Êîäóâàííÿ ñèìâîë³â', 'charset', 4),

	'Äîäàòêîâ³ íàëàøòóâàííÿ',
	array('Óâ³ìêíóòè Debug Mode ðåæèì', 'debug_mode', 1),

	'<br /><div align="center">(*) Ïîëÿ, ïîçíà÷åí³ * íå ïîâèíí³ çì³íþâàòèñü, ÿêùî âè âæå ìàºòå ôîòî â ãàëåðå¿.</div><br />'
);

// ------------------------------------------------------------------------- //
// File db_input.php
// ------------------------------------------------------------------------- //

if (defined('DB_INPUT_PHP')) $lang_db_input_php = array(
	'empty_name_or_com' => 'Âè ïîâèíí³ íàáðàòè âàøå ³ìÿ òà êîìåíòàð',
	'com_added' => 'Âàø êîìåíòàð äîëó÷åíî',
	'alb_need_title' => 'Âêàæ³òü íàçâó àëüáîìó!',
	'no_udp_needed' => 'Îíîâëåííÿ íå ïîòð³áíå',
	'alb_updated' => 'Àëüáîì îíîâëåíî',
	'unknown_album' => 'Îáðàíèé àëüáîì íå ³ñíóº, àáî Âè íå ìàºòå ïîâíîâàæåíü äëÿ äîëó÷åííÿ ôîòî äî öüîãî àëüáîìó',
	'no_pic_uploaded' => 'Ôîòî íå äîëó÷åíî!<br /><br />Ïåðåâ³ðòå ñåðâåð íà ìîæëèâ³ñòü äîëó÷åííÿ ôîòî!',
	'err_mkdir' => 'Ïîìèëêà ïðè ñòâîðåíí³ ïàïêè %s !',
	'dest_dir_ro' => 'Ïàïêà ïðèçíà÷åííÿ %s º ò³ëüêè äëÿ ÷èòàííÿ (äëÿ ñêðèïòà)!',
	'err_move' => 'Íåìîæëèâî ïåðåì³ñòèòè %s â %s !',
	'err_fsize_too_large' => 'Ðîçì³ð ôîòî, ÿêå âè äîëó÷àºòå, çàâåëèêèé (ìàêñèìàëüíèé: %s x %s) !',
	'err_imgsize_too_large' => 'Ðîçì³ð ôàéëó, ÿêèé âè äîëó÷àºòå, çàâåëèêèé (ìàêñèìàëüíèé: %s Ká) !',
	'err_invalid_img' => 'Ôàéë, ÿêèé âè äîëó÷àºòå, ì³ñòèòü ïîìèëêó !',
	'allowed_img_types' => 'Âè ìîæåòå äîëó÷èòè ò³ëüêè %s ôîòî.',
	'err_insert_pic' => 'Ôîòî \'%s\' íå ìîæå áóòè äîëó÷åíå äî àëüáîìó ',
	'upload_success' => 'Ôîòî äîëó÷åíî.<br /><br />Ï³ñëÿ ïåðåâ³ðêè àäì³í³ñòðàòîðîì âîíî çÿâèòüñÿ â àëüáîì³.',
	'info' => '²íôîðìàö³ÿ',
	'com_added' => 'Êîìåíòàð äîëó÷åíî',
	'alb_updated' => 'Àëüáîì îíîâëåíî',
	'err_comment_empty' => 'Âàø êîìåíòàð ïîðîæí³é !',
	'err_invalid_fext' => 'Ïðèéìàþòüñÿ ôàéëè ò³ëüêè íàñòóïíèõ ôîðìàò³â: <br /><br />%s.',
	'no_flood' => 'Ïåðåïðîøóþ, Âè - àâòîð îñòàííüîãî êîìåíòàðÿ äî öüîãî ôîòî.<br /><br />Â³äðåäàãóéòå ïîïåðåäí³é êîìåíòàð, ÿêùî áàæàºòå éîãî âèïðàâèòè.',
	'redirect_msg' => 'Âàñ áóäå ïåðåíàïðàâëåíî.<br /><br /><br />Òèñí³òü \'ÄÀË²\' ÿêùî ñòîð³íêà íå îíîâèòüñÿ àâòîìàòè÷íî',
	'upl_success' => 'Âàø³ ôîòî äîëó÷åíî',
);

// ------------------------------------------------------------------------- //
// File delete.php
// ------------------------------------------------------------------------- //

if (defined('DELETE_PHP')) $lang_delete_php = array(
	'caption' => 'Íàïèñ',
	'fs_pic' => 'ïîâíèé ðîçì³ð ôîòî',
	'del_success' => 'óñï³øíî âèäàëåíî',
	'ns_pic' => 'íîðìàëüíèé ðîçì³ð ôîòî',
	'err_del' => 'âèäàëèòè íåìîæëèâî',
	'thumb_pic' => 'ñëàéä',
	'comment' => 'êîìåíòàð',
	'im_in_alb' => 'ôîòî â àëüáîì³',
	'alb_del_success' => 'Àëüáîì \'%s\' âèäàëåíî',
	'alb_mgr' => 'Êåðóâàííÿ àëüáîìîì',
	'err_invalid_data' => 'Íåâ³ðí³ äàí³ îòðèìàíî â \'%s\'',
	'create_alb' => 'Ñòâîðåííÿ àëüáîìó \'%s\'',
	'update_alb' => 'Îíîâëåííÿ àëüáîìó \'%s\' ç íàçâîþ \'%s\' òà ³íäåêñîì \'%s\'',
	'del_pic' => 'Âèäàëèòè ôîòî',
	'del_alb' => 'Âèäàëèòè àëüáîì',
	'del_user' => 'Âèäàëèòè êîðèñòóâà÷à',
	'err_unknown_user' => 'Îáðàíèé êîðèñòóâà÷ íå ³ñíóº !',
	'comment_deleted' => 'Êîìåíòàð áóëî âèäàëåíî',
);

// ------------------------------------------------------------------------- //
// File displayecard.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File displayimage.php
// ------------------------------------------------------------------------- //

if (defined('DISPLAYIMAGE_PHP')){

$lang_display_image_php = array(
	'confirm_del' => 'Âè ñïðàâä³ áàæàºòå âèäàëèòè öå ôîòî? \\nÊîìåíòàð³ òåæ çíèêíóòü.',
	'del_pic' => 'ÂÈÄÀËÈÒÈ ÔÎÒÎ',
	'size' => '%s x %s ï³êñåë³â',
	'views' => '%s ðàç³â',
	'slideshow' => 'Ñëàéä-øîó',
	'stop_slideshow' => 'ÇÓÏÈÍÈÒÈ ÑËÀÉÄ-ØÎÓ',
);

$lang_picinfo = array(
	'title' =>'²íôîðìàö³ÿ ïðî ôîòî',
	'Filename' => 'Ôàéë',
	'Album name' => 'Àëüáîì',
	'Rating' => 'Ðåéòèíã (%s ãîëîñ³â)',
	'Keywords' => 'Êëþ÷îâ³ ñëîâà',
	'File Size' => 'Ðîçì³ð ôàéëó',
	'Dimensions' => 'Ðîçì³ðè',
	'Displayed' => 'Ïåðåãëÿä³â',
	'Camera' => 'Êàìåðà',
	'Date taken' => 'Date taken',
	'Aperture' => 'Ä³àôðàãìà',
	'Exposure time' => 'Ýêñïîçèö³ÿ',
	'Focal length' => 'Ôîêóñíà â³äñòàíü',
        'Comment' => 'Êîìåíòàð', 
        'addFav' => 'Äîëó÷èòè äî îáðàíîãî', 
        'addFavPhrase' => 'Îáðàí³', 
        'remFav' => 'Âèäàëèòè ç îáðàíèõ',  //new in cpg1.2.0
);

$lang_display_comments = array(
	'OK' => 'OK',
	'edit_title' => 'Ðåäàãóâàòè',
	'confirm_delete' => 'Âèäàëèòè ?',
	'add_your_comment' => 'Êîìåíòóâàòè',
        'name' => '²ìÿ', 
        'comment' => 'Êîìåíòàð', 
        'your_name' => 'Àíîí³ìíî',
);

$lang_fullsize_popup = array( 
        'click_to_close' => 'Íàòèñí³òü íà çîáðàæåííÿ, ùîá çàêðèòè â³êíî',  //new in cpg1.2.0
);

}

// ------------------------------------------------------------------------- //
// File ecard.php
// ------------------------------------------------------------------------- //

if (defined('ECARDS_PHP') || defined('DISPLAYECARD_PHP')) $lang_ecard_php =array(
	'title' => 'Íàä³ñëàòè eCard',
	'invalid_email' => '<strong>Óâàãà</strong> : íåïðàâèëüíà eMail àäðåñà !',
	'ecard_title' => 'eCard â³ä %s äëÿ Âàñ',
	'view_ecard' => 'ßêùî eCard â³äîáðàæåíî íåêîðåêòíî, íàòèñí³òü íà öå ïîñèëàííÿ',
	'view_more_pics' => 'Íàòèñí³òü íà öå ïîñèëàííÿ äëÿ ïåðåãëÿäó âñ³õ ³íøèõ ôîòî!',
	'send_success' => 'Âàøó eÑard íàä³ñëàíî',
	'send_failed' => 'Ñåðâåð íå â ñòàí³ íàä³ñëàòè Âàøó eCard...',
	'from' => 'Â³ä',
	'your_name' => 'Âàøå ³ìÿ',
	'your_email' => 'Âàøà eMail àäðåñà',
	'to' => 'Êîìó',
	'rcpt_name' => '²ìÿ îòðèìóâà÷à',
	'rcpt_email' => 'eMail àäðåñà îòðèìóâà÷à',
	'greetings' => 'Â³òàííÿ',
	'message' => 'Ïîâ³äîìëåííÿ',
);

// ------------------------------------------------------------------------- //
// File editpics.php
// ------------------------------------------------------------------------- //

if (defined('EDITPICS_PHP')) $lang_editpics_php = array(
	'pic_info' => '²íôîðìàö³ÿ ïðî ôîòî',
	'album' => 'Àëüáîì',
	'title' => 'Íàçâà',
	'desc' => 'Îïèñ',
	'keywords' => 'Êëþ÷îâ³ ñëîâà',
	'pic_info_str' => '%sx%s - %sÊá - %s ïåðåãëÿä³â - %s ãîëîñ³â',
	'approve' => 'Ñõâàëèòè ôîòî',
	'postpone_app' => 'Â³äõèëèòè ñõâàëåííÿ',
	'del_pic' => 'Âèäàëèòè ôîòî',
	'reset_view_count' => 'Reset view counter',
	'reset_votes' => 'Âèäàëèòè ãîëîñóâàííÿ',
	'del_comm' => 'Âèäàëèòè êîìåíòàð³',
	'upl_approval' => 'Ïåðåâ³ðêà äîëó÷åíü',
	'edit_pics' => 'Êîðåãóâàòè ôîòî',
	'see_next' => 'Ïåðåãëÿíóòè íàñòóïíå ôîòî',
	'see_prev' => 'Ïåðåãëÿíóòè ïîïåðåäíº ôîòî',
	'n_pic' => '%s ôîòî',
	'n_of_pic_to_disp' => 'Ê³ëüê³ñòü ôîòî íà ìîí³òîð³',
	'apply' => 'Çàñòîñóâàòè'
);

// ------------------------------------------------------------------------- //
// File groupmgr.php
// ------------------------------------------------------------------------- //

if (defined('GROUPMGR_PHP')) $lang_groupmgr_php = array(
	'group_name' => 'Íàçâà ãðóïè',
	'disk_quota' => 'Äèñêîâèé ïðîñò³ð',
	'can_rate' => 'Ìîæóòü îö³íþâàòè ôîòî',
	'can_send_ecards' => 'Ìîæóòü íàäñèëàòè eCards',
	'can_post_com' => 'Ìîæóòü äîëó÷àòè êîìåíòàð³',
	'can_upload' => 'Ìîæóòü äîëó÷àòè ôîòî',
	'can_have_gallery' => 'Ìîæóòü ìàòè îñîáèñò³ ãàëåðå¿',
	'apply' => 'Çàñòîñóâàòè âèïðàâëåííÿ',
	'create_new_group' => 'Ñòâîðèòè íîâó ãðóïó',
	'del_groups' => 'Âèäàëèòè îáðàíó ãðóïó',
	'confirm_del' => 'Óâàãà! Ïî âèäàëåíí³ ãðóïè âñ³ êîðèñòóâà÷³ ç íå¿ áóäóòü ïåðåíåñåí³ â ãðóïó \'Çàðåºñòðîâàí³\'!\n\nÁàæàºòå ïðîäîâæóâàòè?',
	'title' => 'Êåðóâàííÿ ãðóïàìè êîðèñòóâà÷³â',
	'approval_1' => 'Ñõâàëåííÿ çàãàëüíèõ äîëó÷åíü(1)',
	'approval_2' => 'Ñõâàëåííÿ îñîáèñòèõ äîëó÷åíü(2)',
	'note1' => '<strong>(1)</strong> Äîëó÷åííÿ â çàãàëüíèé àëüáîì ïîòðåáóþòü çãîäè àäì³í³ñòðàòîðà',
	'note2' => '<strong>(2)</strong> Äîëó÷åííÿ â àëüáîì êîðèñòóâà÷à ïîòðåáóþòü ïåðåâ³ðêè àäì³í³ñòðàòîðîì',
	'notes' => 'Íîòàòêè'
);

// ------------------------------------------------------------------------- //
// File index.php
// ------------------------------------------------------------------------- //

if (defined('INDEX_PHP')){

$lang_index_php = array(
	'welcome' => 'ÑÊÎÁ!'
);

$lang_album_admin_menu = array(
	'confirm_delete' => 'Áàæàºòå âèäàëèòè öåé àëüáîì? \\nÂñ³ ôîòî ³ êîìåíòàð³ çíèêíóòü.',
	'delete' => 'Âèäàëèòè',
	'modify' => 'Íàëàøòóâàííÿ',
	'edit_pics' => 'Êîðåãóâàòè',
);

$lang_list_categories = array(
	'home' => 'Ïî÷àòîê',
	'stat1' => '<strong>[pictures]</strong> ôîòî â <strong>[albums]</strong> àëüáîìàõ òà <strong>[cat]</strong> êàòåãîð³ÿõ ç <strong>[comments]</strong> êîìåíòàðÿìè, ïåðåãëÿíóòî <strong>[views]</strong> ðàç³â',
	'stat2' => '<strong>[pictures]</strong> ôîòî â <strong>[albums]</strong> àëüáîìàõ ïåðåãëÿíóòî <strong>[views]</strong> ðàç³â',
	'xx_s_gallery' => 'Ãàëåðåÿ %s\'à',
	'stat3' => '<strong>[pictures]</strong> ôîòî â <strong>[albums]</strong> àëüáîìàõ <strong>[comments]</strong> êîìåíòàðÿìè, ïåðåãëÿíóòî <strong>[views]</strong> ðàç³â'
);

$lang_list_users = array(
	'user_list' => 'Ñïèñîê êîðèñòóâà÷³â',
	'no_user_gal' => 'Òóò íåìàº ãàëåðåé êîðèñòóâà÷³â',
	'n_albums' => '%s àëüáîì³â',
	'n_pics' => '%s ôîòî'
);

$lang_list_albums = array(
	'n_pictures' => '%s ôîòî',
	'last_added' => ', îñòàííº äîëó÷åíî %s'
);

}

// ------------------------------------------------------------------------- //
// File login.php
// ------------------------------------------------------------------------- //

if (defined('LOGIN_PHP')) $lang_login_php = array(
	'login' => 'Âõ³ä',
	'enter_login_pswd' => 'Ââåä³òü ³ìÿ òà ïàðîëü äëÿ âõîäó',
	'username' => '²ìÿ',
	'password' => 'Ïàðîëü',
	'remember_me' => 'Çàïàìÿòàòè ìåíå',
	'welcome' => 'ÑÊÎÁ, %s ...',
	'err_login' => '*** Çàéòè íåìîæëèâî. Ñïðîáóé ùå! ***',
	'err_already_logged_in' => 'Âè âæå óâ³éøëè!',
);

// ------------------------------------------------------------------------- //
// File logout.php
// ------------------------------------------------------------------------- //

if (defined('LOGOUT_PHP')) $lang_logout_php = array(
	'logout' => 'Âèõ³ä',
	'bye' => 'Íà âñå äîáðå, %s ...',
	'err_not_loged_in' => 'Âè íå óâ³éøëè!',
);

// ------------------------------------------------------------------------- //
// File modifyalb.php
// ------------------------------------------------------------------------- //

if (defined('MODIFYALB_PHP')) $lang_modifyalb_php = array(
	'upd_alb_n' => 'Îíîâëåííÿ àëüáîìó %s',
	'general_settings' => 'Çàãàëüí³ íàëàøòóâàííÿ',
	'alb_title' => 'Íàçâà',
	'alb_cat' => 'Êàòåãîð³ÿ',
	'alb_desc' => 'Îïèñ',
	'alb_thumb' => 'Ñëàéä',
	'alb_perm' => 'Äîçâîëè äëÿ öüîãî àëüáîìó',
	'can_view' => 'Àëüáîì ìîæíà ïåðåãëÿíóòè',
	'can_upload' => 'Â³äâ³äóâà÷³ ìîæóòü äîëó÷àòè ôîòî',
	'can_post_comments' => 'Â³äâ³äóâà÷³ ìîæóòü çàëèøàòè êîìåíòàð³',
	'can_rate' => 'Â³äâ³äóâà÷³ ìîæóòü îö³íþâàòè ôîòî',
	'user_gal' => 'Ãàëåðåÿ êîðèñòóâà÷³â',
	'no_cat' => '* Íåìàº êàòåãîð³¿ *',
	'alb_empty' => 'Àëüáîì ïîðîæí³é',
	'last_uploaded' => 'Îñòàíí³ äîëó÷åííÿ',
	'public_alb' => 'Çàãàëüíèé àëüáîì',
	'me_only' => 'Ò³ëüêè ÿ',
	'owner_only' => 'Ò³ëüêè âëàñíèê àëüáîìó (%s)',
	'groupp_only' => '×ëåíè ãðóïè \'%s\'',
	'err_no_alb_to_modify' => 'Â áàç³ äàíèõ íåìàº àëüáîì³â, ÿê³ á Âè ìîãëè êîðåãóâàòè.',
	'update' => 'Îíîâèòè àëüáîì'
);

// ------------------------------------------------------------------------- //
// File ratepic.php
// ------------------------------------------------------------------------- //

if (defined('RATEPIC_PHP')) $lang_rate_pic_php = array(
	'already_rated' => 'Öå ôîòî Âè âæå îö³íèëè',
	'rate_ok' => 'Âàø ãîëîñ çàðàõîâàíî',
);

// ------------------------------------------------------------------------- //
// File register.php & profile.php
// ------------------------------------------------------------------------- //

if (defined('REGISTER_PHP') || defined('PROFILE_PHP')) {

$lang_register_disclamer = <<<EOT
Ïîêà àäì³í³ñòðàòîðè '<strong>{SITE_NAME}</strong>' íàìàãàòèìóòüñÿ ÿêíàéøâèäøå ðåäàãóâàòè áóäü - ÿêèé íåáàæàíèé ìàòåð³àë, Âè ï³äòâåðäæóºòå, ùî âñ³ ïîâ³äîìëåííÿ ïîêàçóþòü Âàøó, à íå àäì³í³ñòðàòîð³â ñàéòó, ïîçèö³þ.  <br />
<br />
Âè îá³öÿºòå íå íàäñèëàòè îáðàçëèâî¿, áðóòàëüíî¿, íåïðàâäèâî¿ ³ ò.ä ³íôîðìàö³¿, ³ ïîãîäæóºòåñü ç òèì, ùî âñ³ Âàø³ ïîâ³äîìëåííÿ áóäå çàïèñàíî â áàçó äàíèõ, àäì³í³ñòðàòîðè ìîæóòü êîðåãóâàòè òà âèäàëÿòè Âàø³ ïîâ³äîìëåííÿ òà äîëó÷åííÿ íà ñâ³é ðîçñóä. Çà âñ³ ñïðîáè çëàìàòè ñàéò ÷è áàçó äàíèõ, ³ çà ïîâÿçàí³ ç öèì âòðàòè ³íôîðìàö³¿, ÿê³ ìîæóòü çàøêîäèòè ðîáîò³ ôîòîãàëåðå¿, í³ âåáìàéñòåð, í³ àäì³í³ñòðàòîðè â³äïîâ³äàëüíîñò³ íå íåñóòü.<br />
<br />
Ãàëåðåÿ âèêîðèñòîâóº òåõíîëîã³þ 'cookies' äëÿ ïîêðàùåííÿ ïåðåãëÿäó. Àäðåñà E-mail âèêîðèñòîâóºòüñÿ ò³ëüêè äëÿ ï³äòâåðäæåííÿ Âàøèõ ðåºñòðàö³éíèõ äàíèõ òà ïàðîëþ.<br />
<br />
Íàòèñíóâøè íà "çãîäåí", âè ïîãîäæóºòåñü ç óñ³ì âèùåïåðåë³÷åíèì.
EOT;

$lang_register_php = array(
	'page_title' => 'Ðåºñòðàö³ÿ êîðèñòóâà÷à',
	'term_cond' => 'Óìîâè',
	'i_agree' => 'Çãîäåí',
	'submit' => 'Ïðîäîâæèòè ðåºñòðàö³þ',
	'err_user_exists' => '²ìÿ êîðèñòóâà÷à âæå çàéíÿòå. Ñïðîáóéòå ³íøå!',
	'err_password_mismatch' => 'Ïàðîëè íå ñï³âïàäàþòü, ââåä³òü çíîâó',
	'err_uname_short' => '²ìÿ êîðèñòóâà÷à ïîâèííå ì³ñòèòè ì³í³ìóì 2 ñèìâîëè',
	'err_password_short' => 'Ïàðîëü ïîâèíåí ì³ñòèòè ì³í³ìóì 2 ñèìâîëè',
	'err_uname_pass_diff' => '²ìÿ êîðèñòóâà÷à òà ïàðîëü íå ïîâèíí³ ñï³âïàäàòè',
	'err_invalid_email' => 'Àäðåñó Email âêàçàíî íåâ³ðíî',
	'err_duplicate_email' => 'Ç òàêèì Email âæå õòîñü ðåºñòðóâàâñÿ ',
	'enter_info' => 'Íàäàéòå ðåºñòðàö³éíó ³íôîðìàö³þ',
	'required_info' => 'Íåîáõ³äíà ³íôîðìàö³ÿ',
	'optional_info' => 'Äîäàòêîâà ³íôîðìàö³ÿ',
	'username' => '²ìÿ',
	'password' => 'Ïàðîëü',
	'password_again' => 'Ïîâòîð ïàðîëþ',
	'email' => 'Email',
	'location' => 'Çâ³äêè',
	'interests' => 'Çàõîïëåííÿ',
	'website' => 'Ñàéò',
	'occupation' => '×èì çàéìàºòåñÿ',
	'error' => 'ÏÎÌÈËÊÀ',
	'confirm_email_subject' => '%s - Ï³äòâåðäæåííÿ ðåºñòðàö³¿',
	'information' => '²íôîðìàö³ÿ',
	'failed_sending_email' => 'E-mail ïðî ï³äòâåðäæåííÿ ðåºñòðàö³¿ íå ìîæå áóòè â³äïðàâëåíî!',
	'thank_you' => 'Äÿêóºìî.<br /><br />Íà âàøó àäðåñó áóäå íàä³ñëàíî ëèñòà ç ïîäàëüøèìè âêàç³âêàìè.',
	'acct_created' => 'Çàïèñ ïðî Âàñ ñòâîðåíî. Âè çìîæåòå çàéòè, êîðèñòóþ÷èñü ³ìÿì òà ïàðîëåì',
	'acct_active' => 'Âàø ðàõóíîê àêòèâîâàíî. Âè çìîæåòå çàéòè, êîðèñòóþ÷èñü ³ìÿì òà ïàðîëåì',
	'acct_already_act' => 'Âàø ðàõóíîê âæå àêòèâîâàíî!',
	'acct_act_failed' => 'Öåé ðàõóíîê íå ìîæå áóòè àêòèâîâàíèì!!',
	'err_unk_user' => 'Îáðàíèé êîðèñòóâà÷ íå ³ñíóº!',
	'x_s_profile' => 'Ïðîô³ëü %s',
	'group' => 'Ãðóïà',
	'reg_date' => 'Äàòà ðåºñòðàö³¿',
	'disk_usage' => 'Âèêîðèñòàííÿ äèñêà',
	'change_pass' => 'Çì³íèòè ïàðîëü',
	'current_pass' => 'Òåïåð³øí³é ïàðîëü',
	'new_pass' => 'Íîâèé ïàðîëü',
	'new_pass_again' => 'Íîâèé ïàðîëü (ùå ðàç)',
	'err_curr_pass' => 'Òåïåð³øí³é ïàðîëü - íåâ³ðíèé',
	'apply_modif' => 'Çàñòîñóâàòè çì³íè',
	'change_pass' => 'Çì³íèòè ì³é ïàðîëü',
	'update_success' => 'Âàø ïðîô³ëü îíîâëåíî',
	'pass_chg_success' => 'Âàø ïàðîëü çì³íåíî',
	'pass_chg_error' => 'Âàø ïàðîëü íå çì³íåíî',
);

$lang_register_confirm_email = <<<EOT
Äÿêóºìî çà ðåºñòðàö³þ íà {SITE_NAME}

Âàøå ³ìÿ  : "{USER_NAME}"
Âàø ïàðîëü: "{PASSWORD}"

Ùîá àêòèâóâàòè âàø ðàõóíîê, íàòèñí³òü íà ïîñèëàííÿ, àáî ñêîï³þéòå éîãî äî 
âåá - áðàóçåðà.

{ACT_LINK}

Ç ïîâàãîþ,

Àäì³íèñòðàö³ÿ {SITE_NAME}

EOT;

}

// ------------------------------------------------------------------------- //
// File reviewcom.php
// ------------------------------------------------------------------------- //

if (defined('REVIEWCOM_PHP')) $lang_reviewcom_php = array(
	'title' => 'Ïåðåâ³ðêà êîìåíòàð³â',
	'no_comment' => 'Òóò íåìàº êîìåíòàð³â äëÿ ïåðåâ³ðêè',
	'n_comm_del' => '%s êîìåíòàð³â âèäàëåíî',
	'n_comm_disp' => 'Ê³ëüê³ñòü êîìåíòàð³â äëÿ ïîêàçó',
	'see_prev' => 'Ïåðåãëÿíóòè ïîïåðåäí³é',
	'see_next' => 'Ïåðåãëÿíóòè íàñòóïíèé',
	'del_comm' => 'Âèäàëèòè âèáðàí³ êîìåíòàð³',
);


// ------------------------------------------------------------------------- //
// File search.php - OK
// ------------------------------------------------------------------------- //

if (defined('SEARCH_PHP')) $lang_search_php = array(
	0 => 'Ïîøóê êîëåêö³¿ ôîòî',
);

// ------------------------------------------------------------------------- //
// File searchnew.php
// ------------------------------------------------------------------------- //

if (defined('SEARCHNEW_PHP')) $lang_search_new_php = array(
	'page_title' => 'Øóêàòè íîâ³ ôîòî',
	'select_dir' => 'Âèáðàòè ïàïêó',
	'select_dir_msg' => 'Öÿ ôóíêö³ÿ äîçâîëÿº äîëó÷àòè ôîòî â \'ïàêåòíîìó ðåæèì³\'.<br /><br />Îáåð³òü ïàïêó äëÿ Âàøèõ ôîòî',
	'no_pic_to_add' => 'Íåìàº ôîòî äëÿ äîëó÷åííÿ',
	'need_one_album' => 'Äëÿ âèêîèñòàííÿ ö³º¿ ôóíêö³¿ Âàì ïîòð³áåí ùîíàéìåíøå îäèí àëüáîì',
	'warning' => 'Óâàãà',
	'change_perm' => 'ñêðèïò íå ìîæå çàïèñàòè äàí³ äî ïàïêè. Çì³í³òü ïðàâà äîñòóïó íà 755 ÷è 777 ïåðåä ñïðîáîþ äîëó÷èòè ôîòî!',
	'target_album' => '<strong>Ïåðåì³ñòèòè ôîòî ç &quot;</strong>%s<strong>&quot; äî </strong>%s',
	'folder' => 'Ïàïêà',
	'image' => 'Ôîòî',
	'album' => 'Àëüáîì',
	'result' => 'Ðåçóëüòàò',
	'dir_ro' => 'ò³ëüêè äëÿ ÷èòàííÿ. ',
	'dir_cant_read' => 'Íåìîæëèâî ïðî÷èòàòè. ',
	'insert' => 'Äîëó÷åííÿ íîâèõ ôîòî äî ãàëåðå¿',
	'list_new_pic' => 'Ñïèñîê íîâèõ ôîòî',
	'insert_selected' => 'Äîëó÷èòè âèáðàí³ ôîòî',
	'no_pic_found' => 'Íîâèõ ôîòî íå çíàéäåíî',
	'be_patient' => 'Äëÿ äîëó÷åííÿ ôîòî ïîòð³áåí ÷àñ',
	'notes' =>  '<ul>'.
				'<li><strong>OK</strong> : îçíà÷àº, ùî ôîòî äîëó÷åíî'.
				'<li><strong>DP</strong> : îçíà÷àº, ùî òàêå ôîòî âæå º â áàç³'.
				'<li><strong>PB</strong> : îçíà÷àº, ùî ôîòî íå äîëó÷åíî. Âàðòî ïåðåâ³ðèòè  äîçâîëè íà íàëàøòóâàííÿ â ïàïêàõ, äå çíàõîäèòüñÿ ôîòî'.
				'<li>ßêùî \'çíàêè\' OK, DP, PB íå çÿâëÿþòüñÿ, íàòèñí³òü íà ïîãàíîìó ôîòî, ùîá ïîáà÷èòè ïîìèëêó, çðîáëåíó PHP'.
				'<li>ßêùî áðîóçåð êàæå \'timeout\', íàòèñí³òü êíîïêó \'Îíîâèòè\' (Refresh)'.
				'</ul>',
);


// ------------------------------------------------------------------------- //
// File thumbnails.php
// ------------------------------------------------------------------------- //

// Void


// ------------------------------------------------------------------------- // 
// File banning.php 
// ------------------------------------------------------------------------- // 

if (defined('BANNING_PHP')) $lang_banning_php = array( 
                'title' => 'Áàí êîðèñòóâà÷³â', 
                'user_name' => 'Âàøå ³ìÿ', 
                'ip_address' => 'IP àäðåñà', 
                'expiry' => 'Òåðì³í çàê³í÷åííÿ (ÿêùî íåâêàçàíî - íàçàâæäè)', 
                'edit_ban' => 'Çáåðåãòè çì³íè', 
                'delete_ban' => 'Âèäàëèòè', 
                'add_new' => 'Äîëó÷èòè íîâèé áàí', 
                'add_ban' => 'Äîëó÷èòè', 
); 

// ------------------------------------------------------------------------- //
// File upload.php
// ------------------------------------------------------------------------- //

if (defined('UPLOAD_PHP')) $lang_upload_php = array(
	'title' => 'Äîëó÷èòè ôîòî',
	'max_fsize' => 'Ìàêñèìàëüíèé  ðîçì³ð ôàéëó: %s êá',
	'album' => 'Àëüáîì',
	'picture' => 'Ôîòî',
	'pic_title' => 'Íàçâà ôîòî',
	'description' => 'Îïèñ ôîòî',
	'keywords' => 'Êëþ÷îâ³ ñëîâà<br>',
	'err_no_alb_uploadables' => 'Ïåðåïðîøóþ, òóò íåìàº àëüáîìó, êóäè á Âè ìîãëè äîëó÷èòè ôîòî',
);

// ------------------------------------------------------------------------- //
// File usermgr.php
// ------------------------------------------------------------------------- //

if (defined('USERMGR_PHP')) $lang_usermgr_php = array(
	'title' => 'Êåðóâàííÿ êîðèñòóâà÷àìè',
	'name_a' => '²ìåí³ [çðîñòàííÿ]',
	'name_d' => '²ìåí³ [ñïàäàííÿ]',
	'group_a' => 'Ãðóï³ [çðîñòàííÿ]',
	'group_d' => 'Ãðóï³ [ñïàäàííÿ]',
	'reg_a' => 'Äàò³ ðåºñòðàö³¿ [çðîñòàííÿ]',
	'reg_d' => 'Äàò³ ðåºñòðàö³¿ [ñïàäàííÿ]',
	'pic_a' => 'Ê³ëüêîñò³ çîáðàæåíü [çðîñòàííÿ]',
	'pic_d' => 'Ê³ëüêîñò³ çîáðàæåíü [ñïàäàííÿ]',
	'disku_a' => 'Disk usage [çðîñòàííÿ]',
	'disku_d' => 'Disk usage [ñïàäàííÿ]',
	'sort_by' => 'Ñîðòóâàòè êîðèñòóâà÷³â ïî',
	'err_no_users' => 'Òàáëèöÿ êîðèñòóâà÷³â ïîðîæíÿ!',
	'err_edit_self' => 'Âè íå ìîæåòå êîðåãóâàòè Âàø ïðîô³ëü, äëÿ öüîãî íàòèñí³òü ïîñèëàííÿ \'Ïðîô³ëü\'',
	'edit' => 'ÊÎÐÅÃÓÂÀÒÈ',
	'delete' => 'ÂÈÄÀËÈÒÈ',
	'name' => '²ìÿ êîðèñòóâà÷à',
	'group' => 'Ãðóïà',
	'inactive' => 'Íåàêòèâíèé',
	'operations' => 'Ä³¿',
	'pictures' => 'Çîáðàæåííÿ',
	'disk_space' => 'Äèñêîâèé ïðîñò³ð',
	'registered_on' => 'Çàðåºñòðîâàíî',
	'u_user_on_p_pages' => '%d êîðèñòóâà÷(³â) íà %d ñòîð³íö³(àõ)',
	'confirm_del' => 'Áàæàºòå âèäàëèòè öüîãî êîðèñòóâà÷à? \\nÉîãî çîáðàæåííÿ òà àëüáîìè òåæ çíèêíóòü.',
	'mail' => 'ÏÎØÒÀ',
	'err_unknown_user' => 'Îáðàíèé êîðèñòóâà÷ íå ³ñíóº !',
	'modify_user' => 'Çì³íà êîðèñòóâà÷à',
	'notes' => 'Çàóâàæåííÿ',
	'note_list' => '<li>ßêùî âè íå áàæàºòå çì³íþâàòè ïàðîëü, çàëèøòå ïîëå "ïàðîëü" ïîðîæí³ì',
	'password' => 'Ïàðîëü',
	'user_active' => 'Êîðèñòóâà÷ àêòèâíèé',
	'user_group' => 'Ãðóïà',
	'user_email' => 'Email',
	'user_web_site' => 'Âåáñàéò',
	'create_new_user' => 'Ñòâîðèòè íîâîãî êîðèñòóâà÷à',
	'user_location' => 'Çâ³äêè',
	'user_interests' => 'Çàö³êàâëåííÿ',
	'user_occupation' => 'Ðîáîòà',
);


// ------------------------------------------------------------------------- // 
// File util.php 
// ------------------------------------------------------------------------- // 

if (defined('UTIL_PHP')) $lang_util_php = array( 
        'title' => 'Çì³íèòè ðîçì³ð', 
        'what_it_does' => 'Ùî öå äàñòü', 
        'what_update_titles' => 'Îíîâèòè íàçâó ç ³ìåí³ ôàéëó', 
        'what_delete_title' => 'Âèäàëèòè íàçâè', 
        'what_rebuild' => 'Ïåðåøèêóâàòè åñê³çè òà çì³íèòè ðîçì³ð ôîòî', 
        'what_delete_originals' => 'Çàì³íèòè îðèã³íàëè ôîòêàìè ³ç çì³íåíèì ðîçì³ðîì.', 
        'file' => 'Ôàéë', 
        'title_set_to' => 'âñòàíîâëåíî íàçâó', 
        'submit_form' => 'â³äïðàâèòè', 
        'updated_succesfully' => 'îíîâëåííÿ â³äáóëîñü', 
        'error_create' => 'ÏÎÌÈËÊÀ ñòâîðåííÿ', 
        'continue' => 'Ó ïðîöåñ³ áàãàòî çîáðàæåíü', 
        'main_success' => 'Ôàéë %s âèêîðèñòîâóâàâñÿ ÿê ãîëîâíå çîáðàæåííÿ', 
        'error_rename' => 'Ïîìèëêà ïåðåéìåíóâàííÿ %s â %s', 
        'error_not_found' => 'Ôàéë %s íå çíàéäåíî', 
        'back' => 'íà ãîëîâíó', 
        'thumbs_wait' => 'Îíîâëåííÿ åñê³ç³â àáî çì³íà ðîçì³ð³â, ïðîøó çà÷åêàòè ...', 
        'thumbs_continue_wait' => 'Ïðîäîâæåííÿ Îíîâëåííÿ åñê³ç³â àáî çì³íè ðîçì³ð³â ...', 
        'titles_wait' => 'Îíîâëåííÿ íàçâ, ïðîøó çà÷åêàòè ...', 
        'delete_wait' => 'Âèäàëåííÿ íàçâ, ïðîøó çà÷åêàòè ...', 
        'replace_wait' => 'Âèäàëåííÿ îðèã³íàë³â òà çàì³íà çì³íåíèìè çîáðàæåííÿìè, ïðîøó çà÷åêàòè ...', 
        'instruction' => '²íñòðóêö³¿', 
        'instruction_action' => 'Îáåð³òü ä³þ', 
        'instruction_parameter' => 'Âñòàíîâèòè ïàðàìåòðè', 
        'instruction_album' => 'Îáðàòè àëüáîì', 
        'instruction_press' => 'Íàòèñí³òü %s', 
        'update' => 'Îíîâëåííÿ åñê³ç³â àáî ðîçì³ð³â ôîòî', 
        'update_what' => 'Ùî ìàº áóòè îíîâëåíå', 
        'update_thumb' => 'Ò³ëüêè ñëàéäè', 
        'update_pic' => 'Ò³ëüêè çì³íà ðîçì³ð³â', 
        'update_both' => 'Ñëàéäè òà çì³íà ðîçì³ð³â', 
        'update_number' => 'Ê³ëüê³ñòü êîðåãîâàíèõ çîáðàæåíü', 
        'update_option' => '(ßêùî ó Âàñ ïðîáëåìè ç timeout, ñïðîáóéòå íàëàùòóâàòè îïö³þ çíèçó)', 
        'filename_title' => 'Íàçâà ôàéëó? Íàçâà çîáðàæåííÿ', 
        'filename_how' => 'ßê ìàº áóòè çì³íåíà íàçâà çîáðàæåííÿ', 
        'filename_remove' => 'Âèäàëèòè .jpg ³ çàì³íèòè _ (ï³äêðåñëåííÿ) ç ïðîá³ëàìè', 
        'filename_euro' => 'Çì³íèòè 2003_11_23_13_20_20.jpg íà 23/11/2003 13:20', 
        'filename_us' => 'Çì³íèòè 2003_11_23_13_20_20.jpg íà 11/23/2003 13:20', 
        'filename_time' => 'Çì³íèòè 2003_11_23_13_20_20.jpg íà 13:20', 
        'delete' => 'Âèäàëèòè íàçâó çîáðàæåííÿ òà îðèã³íàëüíèé ðîçì³ð ôîòî', 
        'delete_title' => 'Âèäàëèòè íàçâó çîáðàæåííÿ', 
        'delete_original' => 'Âèäàëèòè îðèã³íàëüíèé ðîçì³ð çîáðàæåííÿ', 
        'delete_replace' => 'Çì³íèòè îðèã³íàëüí³ ôîòî ôîòêàìè ç³ çì³íåíèì ðîçì³ðîì.', 
        'select_album' => 'îáðàòè àëüáîì àëüáîì', 
);
// ------------------------------------------------------------------------- //
// File pagetitle.inc.php
// ------------------------------------------------------------------------- //
$lang_pagetitle_php = array(   
'divider' => '>',
    'viewing' => 'Viewing Photo',
    'usr' => "'s Photo Gallery",
    'photogallery' => 'Photo Gallery',
    );

?>